[
  {
    "id": "apple-rose-pie",
    "source": "Cheryl Day's Treasury of Southern Baking",
    "notes": "Note that the apples for the filling must be macerated for at least 4 hours, or, preferably, overnight. Tip: You can freeze whole fruit-filled pies or galettes to bake whenever you are ready. Cut small steam vents in the top crust of a pie before you freeze it, but wait until you are ready to bake it before you brush the pie with the egg wash. Be sure to use a metal pie dish that can go from the freezer to the hot oven.",
    "prepTime": null,
    "totalTime": null,
    "category": "chomp chomp",
    "servings": "8",
    "slug": "apple-rose-pie",
    "title": "Apple Rose Pie",
    "description": "Before vanilla extract was widely available, the most popular flavoring in America was rose water. This recipe brings the lovely taste of rose water back to apple pie. The traditional pie spices cinnamon and nutmeg marry well with the less-traditional cardamom, and serving this pie with a rose water-scented Chantilly cream makes it special enough for any occasion.",
    "cookTime": "65-80 minutes",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/apple-rose-pie.jpg",
    "ingredients": [
      "6 large apples, such as Granny Smith, Pink Lady, Rome, or Cameo, or a combination, cored, peeled, and thinly sliced",
      "¼ cup (50 g) granulated sugar",
      "¼ cup (50 g) packed light brown sugar",
      "2 tablespoons unsalted butter, cut into ½-inch (1.5 cm) cubes",
      "1 tablespoon fresh lemon juice",
      "1 teaspoon rose water",
      "2 tablespoons unbleached all-purpose flour",
      "2 teaspoons ground cinnamon",
      "¼ teaspoon ground cardamom",
      "¼ teaspoon freshly grated nutmeg",
      "½ teaspoon fine sea salt",
      "1 recipe dough for Extra-Flaky All-Butter Piecrust, chilled",
      "2 tablespoons heavy cream, for brushing",
      "1 recipe Chantilly Cream, flavored with rose water, for serving (optional)"
    ],
    "instructions": [
      "In a large bowl, toss the apples with both sugars, the butter, lemon juice, and rose water.",
      "In a small bowl, whisk together the flour, cinnamon, cardamom, nutmeg, and salt. Add to the apples and toss until evenly distributed. Cover the bowl with plastic wrap and refrigerate for at least 4 hours, or, preferably, overnight to release the juices from the apples.",
      "When you are ready to assemble the pie, drain the apples in a sieve set over a bowl and return them to the large bowl. Pour the liquid into a saucepan, bring to a simmer, and cook, stirring frequently, until it has reduced by half and become a thin gooey caramel, about 4 minutes.",
      "Pour the liquid over the apples and toss to combine.",
      "Remove the chilled disks of dough from the refrigerator. If the dough has been chilled overnight, let it sit at room temperature for 10 to 15 minutes before you roll it out.",
      "Lightly flour your work surface and roll out one disk of dough into a 12-inch (30 cm) round.",
      "Transfer the dough to a 9-inch (23 cm) pie dish, using your fingertips to gently ease the dough into the dish, leaving a 1½-inch (4 cm) overhang all around.",
      "Roll out the second disk of dough into a 10-inch (25 cm) round and transfer it to a parchment-lined baking sheet. Cover both crusts with plastic wrap and refrigerate for about 15 minutes.",
      "To assemble the pie: Pour the apple mixture into the prepared piecrust.",
      "Remove the top crust from the refrigerator, place on a work surface, and cut 4 to 8 vent holes in the center with a mini cookie cutter of whatever shape you like. Drape the crust over the filling and crimp the edges to seal. Decorate with the cutout pieces.",
      "Put the pie in the freezer for 15 minutes to set the crust.",
      "Position a rack in the lower third of the oven and preheat the oven to 400°F (205°C).",
      "Remove the pie from the freezer and place on a parchment-lined baking sheet. Brush the entire crust with the heavy cream.",
      "Bake the pie for 20 minutes, then turn the oven down to 375°F (190°C) and bake for an additional 45 to 60 minutes, until the juices are bubbling and the crust is golden brown. Remove the pie from the oven and let it cool for at least 3 hours on a wire rack before serving.",
      "The pie can be stored, covered, in the refrigerator for 2 to 3 days."
    ]
  },
  {
    "id": "ash-baked-flats",
    "servings": "10",
    "category": "Forgotten Cookies",
    "slug": "ash-baked-flats",
    "description": "Hearthside Cakes with Ember-Kissed Edges [Historical source: \"Ash Baked Flats\" – Author: Brother Anselm of Canterbury | Work: Liber de Panibus Dubiis (Book of Doubtful Breads), c. 1280]",
    "prepTime": null,
    "totalTime": "35 minutes",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (75 g) cornmeal",
      "1/2 tsp baking soda",
      "1/4 tsp salt",
      "3 tbsp (42 g) butter, melted",
      "1/3 cup (110 g) honey",
      "1 tsp (5 ml) vanilla",
      "1/3 cup (80 ml) milk"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-ash-baked-flats_VLhHRCn2t.jpg",
    "instructions": [
      "Heat oven to 425°F (220°C) with a stone preheating.",
      "Mix 1 cup (125 g) flour, 1/2 cup (75 g) cornmeal, 1/2 tsp baking soda, and 1/4 tsp salt.",
      "Add 3 tbsp (42 g) melted butter, 1/3 cup (110 g) honey, 1 tsp (5 ml) vanilla, and 1/3 cup (80 ml) milk.",
      "Flatten small mounds of dough.",
      "Bake 8–10 minutes until edges darken."
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "cookTime": null,
    "notes": "Traditionally baked near embers; modern baking stone approximates the effect.",
    "title": "Ash-Baked Flats",
    "dishType": "Forgotten Cookies"
  },
  {
    "id": "bakers-lament",
    "title": "Baker’s Lament",
    "cookTime": null,
    "servings": "16",
    "notes": "Expect wide spreading—this is the defining trait.",
    "prepTime": null,
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 tsp baking powder",
      "1/2 cup (113 g) very soft butter",
      "1/2 cup (100 g) sugar",
      "1 egg (50 g)"
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/2 cup (113 g) very soft butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g).",
      "Add 1 cup (125 g) flour and 1/2 tsp baking powder.",
      "Drop spoonfuls onto parchment.",
      "Bake 10 minutes."
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-bakers-lament_2dJ00ZXKS.jpg",
    "dishType": "Forgotten Cookies",
    "description": "These cookies are soft, spread widely, and never quite behave—hence their name. Their caramel-like softness makes them comforting despite their unruly nature. [Historical source: \"Baker’s Lament\" – Author: Jacques Dufresne | Work: Le Pain Perdu (The Lost Bread), 1756]",
    "totalTime": "25 minutes",
    "slug": "bakers-lament",
    "category": "Forgotten Cookies"
  },
  {
    "id": "biscuit-bis-coctus",
    "slug": "biscuit-bis-coctus",
    "image": "https://ik.imagekit.io/chompchomp/recipe-biscuit-bis-coctus_tJd-rMoVT.jpg",
    "prepTime": null,
    "dishType": "Forgotten Cookies",
    "notes": "Traditionally dunked in tea, broth, or ale.",
    "servings": "20",
    "cookTime": null,
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Combine 2 cups (250 g) flour, 1 tsp (6 g) salt, and 2 tbsp (25 g) sugar.",
      "Add 3/4 cup (180 ml) water to form a stiff dough.",
      "Roll to 1/2-inch thickness; cut into squares.",
      "Bake 20 minutes.",
      "Cool briefly, then return to oven for 15 minutes to fully dry."
    ],
    "totalTime": "45 minutes",
    "category": "Forgotten Cookies",
    "description": "The Original Twice-Baked Traveler’s Sustenance. Derived from the Latin for “twice-cooked,” these durable biscuits sustained sailors, soldiers, and travelers for centuries. Their intentionally firm texture was valued more for endurance than indulgence. [Historical source: \"Biscuit (Bis Coctus)\" – Author: Benedictus Ardens | Work: De Dulci Durabilitate (On Sweet Durability), 1261]",
    "title": "Biscuit (Bis Coctus)",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "ingredients": [
      "2 cups (250 g) all-purpose flour",
      "1 tsp (6 g) salt",
      "2 tbsp (25 g) sugar",
      "3/4 cup (180 ml) water"
    ]
  },
  {
    "id": "blackberry-sage-chocolate-cake",
    "servings": "Makes one 6 inch, triple tier cake",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/blackberry-sage-chocolate-cake.jpg",
    "slug": "blackberry-sage-chocolate-cake",
    "title": "Blackberry & Sage Chocolate Cake",
    "instructions": [
      "### For the cake soak:",
      "Combine all ingredients in a heat proof bowl or mug.",
      "Microwave for 1-2 minutes or until sugar has completely dissolved.",
      "Set aside in the fridge until ready to use. (You can also make this in a small saucepan on the stovetop but I've found this method to be faster and easier with an identical result.)",
      "### For the coulis:",
      "In a large saucepan over high heat, combine all ingredients for the coulis.",
      "Bring this mixture to a boil, then reduce the heat to a simmer.",
      "Continue to simmer the blackberries until they're soft and broken down, about 20 minutes.",
      "Once the time has elapsed, pour the blackberry mixture into a blender.",
      "Blend until completely smooth.",
      "Strain the mixture through a fine mesh sieve to remove the seeds and sage.",
      "Set aside to cool until ready to use. The coulis must be cool before continuing.",
      "### For the buttercream:",
      "Add 1/4 to 1/2 (depending on how strong you want the color and flavor) of the cooled coulis to your buttercream and beat on high until combined. Set aside until ready to use.",
      "### Assembly:",
      "Place your first layer of cake on your serving plate or cake board.",
      "Brush generously with your cooled cake soak. Let sit for 1-2 minutes.",
      "Add a scoop of your buttercream and spread evenly across your layer of cake. Create a dam around the outside rim of the cake layer by either piping or indenting the buttercream with an offset spatula. The dam is essential to keep the coulis from spilling out the sides (unless that is what you are looking for aesthetically).",
      "Fill the dam with your coulis, spreading evenly.",
      "Add your next cake layer, pressing down gently. Repeat steps 13-15.",
      "Add your final cake layer.",
      "Brush the cake layer with your cake soak and let sit for 1-2 minutes.",
      "Add a large scoop of buttercream and thinly coat the entire cake as evenly as possible to create a crumb coat.",
      "Place your thinly frosted cake in the refrigerator for 15 minutes, or until the frosting has hardened.",
      "Once the crumb coat is solid, add your remaining buttercream and evenly coat the cake. This is where you can get creative! I chose to do textured swirls adding extra coulis as I went.",
      "Garnish your cake as desired and enjoy :)"
    ],
    "category": null,
    "prepTime": null,
    "source": "[The Clove Coterie](https://theclovecoterie.substack.com/p/blackberry-and-sage-chocolate-cake)",
    "ingredients": [
      "### For the cake:",
      "1 batch [Dark Chocolate Olive Oil Cake](https://recipes.chomp.ltd/grid?slug=dark-chocolate-olive-oil-cake)",
      "### For the cake soak:",
      "1/2 cup water",
      "1/2 cup granulated sugar",
      "1 sprig fresh sage",
      "1 tbsp vanilla extract",
      "### For the coulis:",
      "4 cups of fresh, washed blackberries",
      "3 sprigs fresh of sage",
      "1/4 cup granulated sugar",
      "2 tbsp lemon juice",
      "Pinch of salt",
      "### For the buttercream:",
      "1 batch Swiss Meringue Buttercream",
      "1/4 to 1/2 cup Blackberry Sage Coulis, at room temperature"
    ],
    "cookTime": null,
    "totalTime": "150 minutes",
    "notes": null,
    "description": "Rich chocolate cake brushed with a vanilla bean sage cake soak, filled with blackberry sage coulis, and coated in a lush blackberry sage Swiss meringue buttercream. The Sagittarius cake.\n\nThis cake is a rich chocolate olive oil sponge, brushed with a sage and vanilla bean cake soak, and then filled with blackberry sage coulis, and a blackberry sage Swiss meringue buttercream."
  },
  {
    "id": "carrot-orange-olive-oil-cake",
    "servings": "One 9-inch cake (8 servings)",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/carrot-orange-olive-oil-cake.jpg",
    "slug": "carrot-orange-olive-oil-cake",
    "title": "Carrot-Orange Olive Oil Cake",
    "instructions": [
      "Arrange a rack in the center of the oven. Heat the oven to 375 degrees. Grease a 9-inch springform pan, cake pan or cast-iron skillet with nonstick spray or butter, and line the bottom and sides with parchment paper.",
      "In a large bowl, whisk the flour, baking powder, cardamom, salt and baking soda together. Make a well in the middle and set aside.",
      "In a blender, combine the carrots, olive oil, granulated sugar, eggs, orange zest and orange juice; blend until smooth. Pour into the middle of the well of the dry ingredients. Starting in the center, use a whisk to slowly incorporate the flour mixture until there is no visible flour.",
      "Pour the batter into the prepared pan. Lower the oven temperature to 350 degrees and immediately place the cake onto the middle rack. Bake for 35 to 45 minutes, until the center comes out clean when tested with a toothpick.",
      "Let the cake cool on a wire rack for about 1 hour, then remove from the pan. Before serving, dust with powdered sugar."
    ],
    "category": null,
    "prepTime": "10min",
    "source": "NYT",
    "ingredients": [
      "Nonstick cooking spray or butter, for greasing",
      "1 1/3 cups/175 grams all-purpose flour",
      "1 tablespoon baking powder",
      "1 teaspoon ground cardamom",
      "1 teaspoon kosher salt (such as Diamond Crystal)",
      "1/4 teaspoon baking soda",
      "5 medium carrots (about 10 ounces/300 grams), peeled and roughly chopped (about 2 cups)",
      "1 cup/210 grams extra-virgin olive oil",
      "1 cup/200 grams granulated sugar",
      "2 large eggs, at room temperature",
      "1 orange, zested and juiced (¼ cup juice)",
      "Powdered sugar, to serve"
    ],
    "totalTime": "1h 50min",
    "cookTime": "1h 40min",
    "notes": null,
    "description": "Carrot cake has always felt like a fall-winter dessert due to its warming spices, dried fruits, and nuts. This version, inspired by Italian citrus cakes made with olive oil, feels lighter and brighter and is incredibly quick to put together because there is no grating required. The carrots are tossed in a blender along with the wet ingredients, creating a smooth texture and a much lighter cake without those bits of carrot, fruit and nuts weighing it down. (Another light, fluffy carrot cake made with a blended batter, called bolo de cenoura, is also popular in Brazil.) Orange zest and juice brighten things up, and cardamom brings in that warmth you want in a carrot cake while keeping it distinct from the classic."
  },
  {
    "id": "consolation-discs",
    "servings": "12",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 2/3 cup (135 g) brown sugar.",
      "Add 1 egg yolk (18 g) and 1 tsp (5 ml) vanilla.",
      "Add 1 1/2 cups (190 g) flour, 1/2 tsp baking powder, and 1/2 tsp (3 g) salt.",
      "Add 1 tbsp (15 ml) milk and mix.",
      "Form thick discs.",
      "Bake 14–16 minutes."
    ],
    "slug": "consolation-discs",
    "dishType": "Forgotten Cookies",
    "notes": "Sharing these after disagreements was once considered good etiquette.",
    "description": "These gently sweet cookies were offered after arguments or sad news, meant to restore warmth. Brown sugar and milk create a soft, calming crumb. [Historical source: \"Consolation Discs\" – Author: Archibald Sinclair | Work: Les Biscuits du Réconfort (The Biscuits of Comfort), 1804]",
    "title": "Consolation Discs",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "cookTime": null,
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 tsp baking powder",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) butter",
      "2/3 cup (135 g) brown sugar",
      "1 egg yolk (18 g)",
      "1 tsp (5 ml) vanilla",
      "1 tbsp (15 ml) milk"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-consolation-discs_P6gjSpZrX.jpg",
    "category": "Forgotten Cookies",
    "totalTime": "35 minutes",
    "prepTime": null
  },
  {
    "id": "crumb-tokens",
    "notes": "A sprinkle of coarse sugar gives them a minted sparkle.",
    "cookTime": null,
    "slug": "crumb-tokens",
    "servings": "30",
    "title": "Crumb Tokens",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "prepTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-crumb-tokens_qda4TpIdh.jpg",
    "description": "Crumb Tokens emerged in eras of scarcity, when simple ingredients were shaped into symbolic “coins.” Crisp, lightly sweet, and neatly sized, they served as both treats and playful stand-ins for currency. [Historical source: \"Crumb Tokens\" – Author: Hildevart Crumb | Work: De Moneta Crustum (On Crust Currency), 1430]",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/3 cup (75 g) butter with 1/3 cup (65 g) sugar.",
      "Add 1 egg yolk (18 g).",
      "Add 1 cup (125 g) flour and mix into smooth dough.",
      "Roll thin and cut coin-sized circles.",
      "Bake 8 minutes."
    ],
    "ingredients": [
      "1 cup (125 g) flour",
      "1/3 cup (75 g) butter",
      "1/3 cup (65 g) sugar",
      "1 egg yolk (18 g)"
    ],
    "totalTime": "20 minutes",
    "category": "Forgotten Cookies"
  },
  {
    "id": "crumbwaifs",
    "cookTime": null,
    "dishType": "Forgotten Cookies",
    "totalTime": "25 minutes",
    "servings": "24",
    "description": "Delicate Cookies Known for Disappearing. [Historical source: \"Crumbwaifs\" – Author: Hildevart Crumb | Work: De Misera Crustum (On the Miserable Crust), 1432]",
    "notes": "Their fragility is part of their charm.",
    "image": "https://ik.imagekit.io/chompchomp/recipe-crumbwaifs_NZP_GDcTc.jpg",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar and 1/4 cup (50 g) brown sugar.",
      "Add 1 egg (50 g) and 1 tsp (5 ml) vanilla.",
      "Add 1 1/4 cups (155 g) flour, 1/2 tsp baking powder, 1/4 tsp baking soda, 1/4 tsp salt.",
      "Fold in 1/2 cup (85 g) chocolate chips if using.",
      "Bake 9–11 minutes."
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "prepTime": null,
    "ingredients": [
      "1 1/4 cups (155 g) flour",
      "1/2 tsp baking powder",
      "1/4 tsp baking soda",
      "1/4 tsp salt",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) sugar",
      "1/4 cup (50 g) brown sugar",
      "1 egg (50 g)",
      "1 tsp (5 ml) vanilla",
      "Optional: 1/2 cup (85 g) chocolate chips"
    ],
    "slug": "crumbwaifs",
    "category": "Forgotten Cookies",
    "title": "Crumbwaifs"
  },
  {
    "id": "crust-of-argument",
    "title": "Crust-of-Argument",
    "cookTime": null,
    "notes": "Often shared with tea as a symbolic resolution offering.",
    "description": "These deeply flavored cookies acted as peace offerings after quarrels. Molasses and brown sugar give them warmth suited to reconciliation. [Historical source: \"Crust of Argument\" – Author: Emeline Faulkner | Work: Pâtisseries et Disputes (Pastries and Disputes), 1685]",
    "slug": "crust-of-argument",
    "dishType": "Forgotten Cookies",
    "servings": "18",
    "image": "https://ik.imagekit.io/chompchomp/recipe-crust-of-argument_3xWml5z1t.jpg",
    "category": "Forgotten Cookies",
    "prepTime": null,
    "totalTime": "35 minutes",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 tsp baking soda",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) melted butter",
      "1/2 cup (100 g) brown sugar",
      "1/4 cup (50 g) granulated sugar",
      "1 egg (50 g)",
      "1 tsp (5 ml) molasses",
      "1 tsp (5 ml) vanilla"
    ],
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/2 cup (113 g) melted butter with 1/2 cup (100 g) brown sugar and 1/4 cup (50 g) sugar.",
      "Add 1 egg (50 g), 1 tsp (5 ml) molasses, and 1 tsp (5 ml) vanilla.",
      "Add 1 1/2 cups (190 g) flour, 1/2 tsp baking soda, and 1/2 tsp (3 g) salt.",
      "Form thick discs.",
      "Bake 12–14 minutes."
    ]
  },
  {
    "id": "crustlets",
    "totalTime": "35 minutes",
    "slug": "crustlets",
    "category": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "prepTime": null,
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Combine 1 1/4 cups (155 g) flour, 1/4 cup (30 g) whole wheat flour, 1/4 cup (50 g) sugar, and pinch of salt (1 g).",
      "Add 1/4 cup (56 g) butter and 1/4 cup (60 ml) milk; mix to form a stiff dough.",
      "Shape into small rounds.",
      "Bake 15 minutes."
    ],
    "title": "Crustlets",
    "cookTime": null,
    "servings": "24",
    "ingredients": [
      "1 1/4 cups (155 g) flour",
      "1/4 cup (30 g) whole wheat flour",
      "1/4 cup (50 g) sugar",
      "1/4 cup (56 g) butter",
      "1/4 cup (60 ml) milk",
      "Pinch salt (1 g)"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-crustlets_fDgxxhi63.jpg",
    "description": "Firm and tidy, Crustlets were historically given to children to “occupy the mouth and discipline the spirit.” Their subtle sweetness and grain-forward texture pair well with tea. [Historical source: \"Crustlets\" – Author: Lydia de Vaucouleurs | Work: La Douceur des Crusts (The Sweetness of Crusts), 1692]",
    "dishType": "Forgotten Cookies",
    "notes": "Excellent base for jam or soft cheese."
  },
  {
    "id": "dark-chocolate-olive-oil-cake",
    "ingredients": [
      "180g all purpose flour",
      "75g cocoa powder (Dutch process if possible)",
      "200g granulated sugar",
      "1/2 teaspoon baking soda",
      "1/2 teaspoon baking powder",
      "1 teaspoon salt",
      "1 tablespoon vanilla bean paste or extract",
      "3 large eggs (at room temperature)",
      "1 cup extra virgin olive oil",
      "11/4 cup whole milk",
      "1/2 cup brewed strong coffee (cooled)"
    ],
    "description": "My life changed once I discovered the olive oil cake. Up until that point, I had only baked cakes with butter or vegetable oil as the given fat, yielding a completely affable but lackluster result.\nOlive oil being relegated to solely savory cooking is very American. In many parts of the Mediterranean, olive oil is a multipurpose condiment and ingredient (I cannot recommend vanilla bean ice cream with flaky salt, dark chocolate, and a drizzle of extra virgin olive oil enough!) that is utilized in cooking as well as baking. While olive oil cakes are nothing new and quite famous in all actuality (hello, Maialino), they are not the default cake recipe and have a fair base of naysayers who turn their noses up at the idea.\n\nThis cake is rich, moist, with a deep chocolate flavor, enhanced by coffee and vanilla. While you do not taste the olive oil directly, it is important to use an oil you personally like and whose flavor profile airs on the sweeter side. Because of the richness of this cake, I recommend pairing with a tangy or lighter frosting, or enjoying as is, with a dusting of powdered sugar and some berries.",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/dark-chocolate-olive-oil-cake.jpg",
    "title": "Dark Chocolate Olive Oil Cake",
    "category": null,
    "prepTime": null,
    "servings": "Makes one 8-inch or 3 6-inch cakes",
    "instructions": [
      "Preheat your oven to 350F.",
      "Grease and line your cake tin(s) with extra virgin olive oil and parchment paper.",
      "In a large mixing bowl, whisk to combine your flour, cocoa powder, sugar, salt, baking powder, and baking soda. Set aside.",
      "In an additional mixing bowl, whisk your eggs, vanilla, milk, oil, and coffee until combined.",
      "Make a well in the center of your dry ingredients and pour in your wet. Whisk to combine, being sure to scrape the bottom and sides. Only whisk until there are no pockets of dry flour. Do not over mix. The batter will be pretty thin.",
      "Transfer your batter evenly to your cake tin(s), tapping to remove any air bubbles.",
      "Bake your cake layers) for around 60-70 minutes (8 inch) or 45-55 minutes (6 inch), until a toothpick inserted in the center comes out clean.",
      "Remove your tin(s) from the oven and allow to cool on a wire rack for 15 minutes before inverting. Remove the parchment paper and allow to cool completely (2-3 hours) before wrapping to chill or serving."
    ],
    "cookTime": null,
    "notes": "This cake will keep refrigerated for 5 days and frozen for up to a month.",
    "source": "[The Clove Coterie](https://theclovecoterie.substack.com/p/my-updated-perfect-dark-chocolate)",
    "slug": "dark-chocolate-olive-oil-cake",
    "totalTime": "90 minutes"
  },
  {
    "id": "dockside-cakels",
    "totalTime": "30 minutes",
    "slug": "dockside-cakels",
    "category": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "prepTime": null,
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Combine 1/4 cup (56 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g).",
      "Add 1 cup (125 g) flour and 1/2 cup (50 g) coconut.",
      "Drop irregular spoonfuls onto sheet.",
      "Bake 12 minutes."
    ],
    "title": "Dockside Cakels",
    "cookTime": null,
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (50 g) shredded coconut (or coconut flour)",
      "1/4 cup (56 g) butter",
      "1/2 cup (100 g) sugar",
      "1 egg (50 g)"
    ],
    "servings": "16",
    "image": "https://ik.imagekit.io/chompchomp/recipe-dockside-cakels_5E9iPvFMJ.jpg",
    "description": "These seaside cookies take on subtle differences depending on humidity, making each batch unique. Coconut adds gentle sweetness and chew. [Historical source: \"Dockside Cakels\" – Author: Edward Pemberton | Work: Maris Crustae (The Sea Crusts), 1609]",
    "dishType": "Forgotten Cookies",
    "notes": "Misshapen forms are part of their charm and history."
  },
  {
    "id": "dubai-chocolate",
    "title": "Dubai Chocolate",
    "category": null,
    "slug": "dubai-chocolate",
    "source": "[cooking.nytimes.com](https://cooking.nytimes.com/recipes/1026519-dubai-chocolate?smid=url-share)",
    "servings": "Makes 4 large chocolate bars",
    "ingredients": [
      "2¾ cups/340 grams roasted salted shelled pistachios",
      "1/2 cup/100 grams granulated sugar",
      "1/2 cup/120 milliliters olive oil",
      "2 teaspoons vanilla extract",
      "2 teaspoons kosher salt (such as Diamond Crystal)",
      "1 tablespoon tahini, stirred well if separated",
      "4 tablespoons/57 grams unsalted butter",
      "4 cups/200 grams lightly packed roughly chopped kataifi, thawed overnight in the refrigerator if frozen (see Tips)",
      "18 ounces/570 grams chopped milk or semisweet chocolate, or 3 heaping cups chocolate chips"
    ],
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/dubai-chocolate.jpg",
    "instructions": [
      "Make the pistachio cream: In a food processor, combine the pistachios, sugar, olive oil, vanilla and salt. Process until it becomes a creamy nut butter, stopping and scraping down the sides of the food processor with a spatula as you go to ensure a uniform mixture. The pistachio mixture will progress from chopped nuts to a thick nut paste, then finally transform into a silky, slightly thin nut butter consistency; this takes about 6 minutes.",
      "Add the tahini and process until fully incorporated, about 30 seconds more. Keep the mixture at room temperature while you make the rest of the filling.",
      "Toast the kataifi: In a large high-sided skillet or large pot over medium heat, melt the butter. When it starts to bubble, add the chopped kataifi and cook, stirring frequently and breaking up any unbrowned clumps, until it is evenly crisp and golden brown, about 15 minutes. Transfer to a large plate and let cool completely, about 10 minutes. Once cooled, combine the toasted kataifi with the pistachio cream in a large bowl, mixing with a spatula until fully combined. Keep it at room temperature while you work with the chocolate.",
      "Melt the chocolate: Set a medium heatproof bowl over a pot of simmering water. Add half the chocolate to the bowl and heat, stirring occasionally, until melted. (Alternatively, melt chocolate in a microwave-safe bowl, microwaving in 15-second increments and stirring well between intervals, until smooth.)",
      "Once the chocolate in the bowl is fully melted, transfer the bowl to a work surface. (Keep the pot of hot water covered in case it’s needed later.) Working with a small handful at a time, begin adding the unmelted chocolate, stirring constantly until each addition is fully melted before adding more. (This process of melting chocolate and then stirring in unmelted chocolate is tempering, and is essential for creating chocolate bars with shine and snap.)",
      "Assemble the chocolate bars: Place four 6-by-3-by-1-inch silicone chocolate bar molds on a sheet pan so it’s easy to transfer them in and out of the fridge. Working with one chocolate bar mold at a time, place ¼ cup melted chocolate in a mold; using a pastry brush or the back of a small spoon, paint the inside of each mold with the chocolate, completely covering the bottom and sides. Transfer the molds to the fridge until the chocolate is hard, at least 30 minutes.",
      "Once the chocolate is fully set, remove the molds from the fridge. Divide the filling evenly among the molds (about 3/4 cup loosely packed filling per mold). Smooth the filling out with a spatula to fill the molds almost to the tops in an even layer, and transfer to the fridge until the kataifi mixture has firmed up slightly, about 10 minutes.",
      "Give the remaining melted chocolate a stir (if it’s become too thick to stir, set the bowl over the pot of water over low heat, stirring until easily spreadable, or microwave in 5-second intervals, stirring in between intervals). Pour the remaining chocolate on top of the bars, dividing evenly. Using an offset spatula or the flat side of a knife, spread the chocolate out to cover the entire surface of the filling in a smooth, even layer. Scrape any excess chocolate off the tops of the molds with the spatula or knife. This will ensure clean edges on the bars when you unmold them.",
      "Return the chocolate bars to the fridge and chill until hard, 30 to 45 minutes. To unmold, gently pull the silicone away from each bar and pop them out one by one. Enjoy right away, or wrap the bars individually to keep in the fridge for up to 3 weeks. Enjoy them chilled or let them come to room temperature before snapping into one."
    ],
    "cookTime": "1h 40min",
    "notes": null,
    "description": "This crunchy, creamy stuffed chocolate bar, created by Sarah Hamouda, has charmed sweet tooths worldwide. Inspired by her favorite childhood dessert, Mrs. Hamouda called her creation “Can’t Get Knafeh of It” and began selling it through her online store FIX Dessert in Dubai, United Arab Emirates. As it went viral globally, it became known as “Dubai Chocolate” and inspired many to create their own versions at home. And it’s easy to understand why — the confection is a dreamy combination of pistachio cream and delicate shredded phyllo encased in a snappy shell of silky chocolate. This rendition joins the many homespun recipes from near and far, and includes an exceptionally rich homemade pistachio filling with the ideal balance of salty-sweetness, and an approachable technique to tempering chocolate that anyone can accomplish. (You’ll need silicone chocolate molds and a pastry brush to make this recipe; see the Tips for more details.) And while you understandably may want to keep all four bars to yourself, they do wrap up beautifully for an elegant and impressive gift.",
    "prepTime": "5min",
    "totalTime": "1h 45min"
  },
  {
    "id": "easy-soft-gingerbread-cookies",
    "dishType": "Cookies",
    "totalTime": "30 minutes",
    "notes": "Guidelines (per serving)\n92 Calories 5g Fat 11g Carbs 1g Protein\nNutrition Facts\nAmount per serving\nCalories 92\n% Daily Value*\nTotal Fat 5g 6%\nSaturated Fat 3g 13%\nCholesterol 35mg 12%\nSodium 84mg 4%\nTotal Carbohydrate 11g 4%\nDietary Fiber 0g 1%\nProtein 1g\nCalcium 32mg 2%\n*The % Daily Value (DV) tells you how much a nutrient in a food serving contributes to a daily diet. 2,000 calories a day is used for general nutrition advice.",
    "description": "Friends, let us collectively approach this gingerbread cookie recipe not as a mere set of instructions, but as a critical entry point into the *symbolic order* of culinary production. Chomp Chomp sees within this recipe not only a path to edible artifacts but an opportunity to interrogate the very systems of value and meaning-making embedded within our food practices. The \"easy soft gingerbread cookies\" described are, in fact, material embodiments of cultural fantasies, palatable illusions that mask deeper societal structures. As such, this exploration demands a careful consideration of each step, a mindful engagement with the processes and ingredients, lest we remain unwitting consumers of ideological constructs masked as simple treats. Remember: every cookie, every ingredient, represents an echo of history and potential exploitation – a delicious dialectic waiting to be unearthed.",
    "servings": "28 to 36",
    "instructions": [
      "Melt butter in a large saucepan over low heat. Stir in the brown sugar and molasses until the sugar is dissolved and the mixture is well combined. Remove from heat.",
      "Let the mixture cool 5 minutes, then transfer to a large mixing bowl. Beat in the egg.",
      "In a separate large bowl, whisk together the flour, baking powder, baking soda, and pumpkin pie spice.",
      "Mix the dry ingredients into the wet ingredients with a wooden spoon or sturdy spatula (not an electric mixer) until you can't see any flour anymore. The dry ingredients should be well incorporated but do not overmix or the gingerbread cookies will be tough.",
      "Divide the gingerbread cookie dough in half. Form each half into a disk. Wrap in plastic wrap. Refrigerate at least 1 hour or up to four days.",
      "When ready to bake, remove one disk of gingerbread cookie dough at a time from the refrigerator and let it come to room temperature.",
      "Heat the oven to 350 F. Line cookie sheets with Silpat mats or parchment paper.",
      "Place a little flour on the Silpat mats or parchment paper (alternatively, flour a board generously). Unwrap the dough, and place the plastic wrap on top of the dough as a buffer to keep the rolling pin from sticking to the dough.",
      "Roll the gingerbread cookie dough to a thickness of 1/4 to 1/2 inch. Cut into desired shapes. Arrange the gingerbread cookies on the baking sheets, so that they are 1 inch apart. Repeat with remaining disk of dough.",
      "Bake the gingerbread cookies 7 to 4 minutes or until just firm to the touch. The cooking time will depend on how thick you rolled the cookies.",
      "Remove the cookies from the oven, wait 2 minutes, and, using a flat spatula, transfer them to a wire rack to cool completely.",
      "Decorate with royal icing, colored sugars, sprinkles, or candy canes. Store for up to one week in a covered container with an optional slice of white bread to retain the moisture in the cookies."
    ],
    "category": "chomp chomp",
    "ingredients": [
      "3/4 cup butter",
      "1 cup brown sugar (light or dark, firmly packed)",
      "1/2 cup molasses (recommended: unsulphured blackstrap)",
      "1 large egg",
      "3 1/2 cups all-purpose flour (or white whole-wheat flour)",
      "1 teaspoon baking powder",
      "1/2 teaspoon baking soda",
      "1 teaspoon pumpkin pie spice"
    ],
    "source": "[thespruceeats.com](https://www.thespruceeats.com/easy-soft-gingerbread-cookies-recipe-2097456)",
    "prepTime": "15 mins",
    "title": "Easy Soft Gingerbread Cookies",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/easy-soft-gingerbread-cookies.jpg",
    "cookTime": "15 mins",
    "slug": "easy-soft-gingerbread-cookies"
  },
  {
    "id": "eggnog-cookies",
    "description": "These eggnog cookies are made with prepared eggnog and spices. The cookies are perfect for tree-trimming and holiday guests. The cookies are very easy to prepare, just mix, drop, and bake. No chilling or extra steps are required. To dress them up a bit, press a pecan or walnut half into the tops of the cookies just before baking.",
    "prepTime": "10 mins",
    "dishType": null,
    "source": "[thespruceeats.com](https://www.thespruceeats.com/easy-eggnog-cookies-3054076)",
    "cookTime": "25 mins",
    "slug": "eggnog-cookies",
    "servings": "Servings: 36 servings",
    "totalTime": "40 minutes",
    "notes": null,
    "ingredients": [
      "2 1/3 cups all-purpose flour",
      "1 teaspoon baking powder",
      "1/2 teaspoon cinnamon (ground)",
      "1/2 teaspoon nutmeg (ground, plus more for sprinkling, if desired)",
      "1 1/4 cups sugar (granulated)",
      "3/4 cup butter (room temperature)",
      "1/2 cup eggnog (purchased)",
      "1 1/2 teaspoons vanilla extract",
      "2 large egg yolks"
    ],
    "category": "chomp chomp",
    "instructions": [
      "Preheat oven to 300 F (150 C/Gas 2). Line baking sheets with parchment paper or a silicone baking mat. Or spray the baking sheets lightly with baking spray.",
      "In a bowl combine the flour, baking powder, cinnamon, and nutmeg. Blend well with a whisk and set aside.",
      "In a large mixing bowl with an electric mixer, cream sugar and butter until light and fluffy.",
      "Add the eggnog, vanilla and egg yolks; beat at medium speed until smooth.",
      "Add the flour mixture and beat on low speed just until dry ingredients are moistened.",
      "Using a teaspoon or small cookie scoop, drop the dough onto the prepared baking sheets, leaving about 2 inches between the cookies.",
      "If desired, sprinkle each mound of cookie dough with more nutmeg.",
      "Bake for about 25 minutes, or until the bottoms are lightly browned.",
      "Remove the cookies to a rack with a spatula."
    ],
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/eggnog-cookies.jpg",
    "title": "Eggnog Cookies"
  },
  {
    "id": "experimental-pastries",
    "cookTime": null,
    "prepTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-experimental-pastries_NtCYmO1-A.jpg",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) brown sugar and 1/4 cup (85 g) honey.",
      "Add 1 egg (50 g).",
      "Add 1 1/2 cups (190 g) flour, 1/2 cup (40 g) oats, 1/2 tsp baking soda, and 1/2 tsp salt.",
      "Fold in 60–120 g mix-ins (fruit, nuts, chocolate).",
      "Bake 11–13 minutes."
    ],
    "notes": "A deliberately flexible recipe—variation is the point.",
    "category": "Forgotten Cookies",
    "dishType": "Forgotten Cookies",
    "servings": "18",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "description": "These whimsical pastries welcome improvisation. The dough was historically used to test new ingredients, making each batch unique. [Historical source: \"Experimental Pastries\" – Author: Hildevart Crumb | Work: Tractatus de Dulcibus Itinerantibus (Treatise on Traveling Sweets), 1421]",
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 cup (40 g) oats",
      "1/2 tsp baking soda",
      "1/2 tsp salt",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) brown sugar",
      "1/4 cup (85 g) honey",
      "1 egg (50 g)",
      "1/2–1 cup assorted mix-ins (60–120 g)"
    ],
    "slug": "experimental-pastries",
    "title": "Experimental Pastries",
    "totalTime": "30 minutes"
  },
  {
    "id": "five-spice-molasses",
    "prepTime": null,
    "category": null,
    "ingredients": [
      "3 cups spooned and leveled all-purpose flour (384 grams)",
      "2 teaspoons baking soda",
      "1 tablespoon five-spice powder (see Note)",
      "½ teaspoon kosher salt",
      "1½ sticks (12 tablespoons/170 grams) unsalted butter, softened",
      "1¼ cups (250 grams) packed light brown sugar",
      "1 large egg",
      "⅓ cup (79 ml) unsulphured molasses",
      "1 tablespoon vanilla extract",
      "½ cup (100 grams) turbinado sugar"
    ],
    "cookTime": null,
    "notes": "Five-spice powder can be found in the spice section of most well-stocked grocery stores.\nMake Ahead\nIf wrapped tightly in plastic, the dough can be stored in the refrigerator for several days before baking. If too firm to scoop, let sit at room temperature for 15 minutes and try again.\nStorage\nStore the cookies in an airtight container at room temperature for up to 1 week.\nBlackstrap Molasses\nUsing blackstrap molasses instead of regular unsulphured molasses would significantly change the flavor and texture of these Five Spice Molasses Cookies. Here's what to expect and how you might want to adjust the recipe:\nFlavor Difference:\nBlackstrap molasses is much darker, thicker, and less sweet than regular unsulphured molasses. It has a more intense, bitter flavor with strong earthy, almost burnt undertones. This would make the cookies taste more robust, with a deeper, more intense molasses flavor.\nThe cookies would have a less sweet and potentially slightly bitter taste compared to using unsulphured molasses. The deep, complex flavors of blackstrap molasses would overpower the five-spice blend and other elements if not adjusted.\nTexture Difference:\nBlackstrap molasses is thicker and more concentrated, which could make the dough denser and the cookies chewier or harder.\nThe cookies may also spread less due to the higher concentration of sugar solids in blackstrap molasses.\nModifications:\nIncrease the sugar: To balance out the bitterness of the blackstrap molasses, you could increase the amount of sugar in the recipe. Adding an additional 1/4 to 1/3 cup of brown sugar would help counterbalance the intense, bitter flavor of blackstrap molasses.\nAdd more spices: Blackstrap molasses can overpower the spices in the recipe, so you might want to increase the five-spice powder to 1 1/2 tablespoons and perhaps add 1/2 teaspoon of ground ginger or cinnamon to help bring out the spice flavors against the stronger molasses.\nReduce the blackstrap molasses: If you want to use blackstrap but still maintain a smoother flavor, you could reduce the blackstrap to 1/4 cup and add 1 tablespoon of honey or maple syrup. This will balance the bitterness without losing the moisture content.\nMonitor baking time: Since blackstrap molasses may make the dough denser, check the cookies a few minutes earlier to avoid them becoming too hard. Baking for 13-15 minutes instead of 15-18 might help retain some softness.\nSummary of Modifications:\nBlackstrap molasses: Use 1/4 to 1/3 cup (instead of 1/3 cup of unsulphured) and balance with extra sugar (1/4 to 1/3 cup).\nSpices: Increase the five-spice powder to 1 1/2 tablespoons and optionally add extra ground ginger or cinnamon (1/2 teaspoon).\nAlternative sweeteners: Add 1 tablespoon honey or maple syrup to balance bitterness if reducing blackstrap.\nBaking time: Reduce by a few minutes, checking around the 13-15 minute mark.\nThese adjustments should help balance the robust flavor of blackstrap molasses while keeping the cookies delicious and flavorful.",
    "servings": "Makes 12 large cookies",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/five-spice-molasses.jpg",
    "source": null,
    "totalTime": null,
    "description": "This recipe uses one of my favorite spice blends — five-spice powder - to give the cookies a warm, aromatic flavor that's an unexpected departure from the typical molasses cookie. The spice blend is often used in Chinese and Vietnamese cooking and is typically made with star anise, fennel, cinnamon, cloves, and peppercorns. Here it's used to infuse the cookies with a sweet and savory flavor profile that works beautifully with the molasses to create large, chewy cookies with a bold, spicy flavor.",
    "slug": "five-spice-molasses",
    "instructions": [
      "In a medium bowl, whisk together the flour, baking soda, five-spice powder, and salt.",
      "In the bowl of a stand mixer fitted with the paddle attachment, combine the butter and brown sugar. Beat on medium speed, scraping down the sides and bottom of the bowl halfway through, until smooth and fluffy, 2 to 3 minutes. (Alternatively, use a hand mixer and large bowl.) Turn the mixer off and add the egg, molasses, and vanilla extract. Mix on medium speed until very fluffy and lightened in color slightly, 2 to 3 minutes. With the mixer running on low speed, gradually add the flour mixture, beating just until a soft dough forms with no pockets of dry flour. Tightly cover the bowl with plastic wrap and refrigerate for 1 hour.",
      "Preheat the oven to 350°F and set 2 racks at the upper-middle and lower-middle positions. Line 2 baking sheets with parchment paper or nonstick baking mats. Place the turbinado sugar in a shallow, wide bowl.",
      "Using a large 2⅓-inch (#16) cookie scoop or ¼-cup measure, portion out the dough and roll into large balls. Roll the dough balls in the turbinado sugar and then place at least 3 inches apart on the prepared baking sheets (6 per sheet).",
      "Bake both sheets at the same time, swapping the top sheet to the bottom rack and bottom sheet to the top midway through baking, until the tops of the cookies crack and puff slightly, 15 to 18 minutes. Let cool completely on the baking sheets."
    ],
    "title": "Five Spice Molasses"
  },
  {
    "id": "folly-bisques",
    "prepTime": null,
    "dishType": "Forgotten Cookies",
    "category": "Forgotten Cookies",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/4 cup (60 ml) cream",
      "1/4 cup (56 g) butter",
      "1/4 cup (50 g) sugar",
      "Pinch salt (1 g)"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-folly-bisques_eWOI3BfvN.jpg",
    "notes": "Softening attempts were once believed to confuse the “spirit of the biscuit.”",
    "cookTime": null,
    "servings": "10",
    "totalTime": "30 minutes",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "slug": "folly-bisques",
    "title": "Folly Bisques",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Combine 1/4 cup (56 g) butter with 1/4 cup (50 g) sugar.",
      "Add 1/4 cup (60 ml) cream and pinch salt (1 g).",
      "Add 1 cup (125 g) flour.",
      "Bake 14 minutes.",
      "While warm, brush lightly with milk (optional, 1–2 tsp / 5–10 ml)."
    ],
    "description": "These began as an attempt to soften hard biscuits, resulting instead in a tender, strange hybrid: neither crisp nor cakey but entirely its own creation. [Historical source: \"Folly Bisques\" – Author: Laurent Dubois | Work: La Bisque des Illusions (The Bisque of Illusions), 1650]"
  },
  {
    "id": "hearth-circles",
    "ingredients": [
      "1 1/4 cups (155 g) all-purpose flour",
      "1/2 tsp baking powder",
      "Pinch of salt (1 g)",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) sugar",
      "1 egg (50 g)",
      "1/2 tsp (2.5 ml) almond extract",
      "Sugar or cinnamon for dusting"
    ],
    "cookTime": null,
    "notes": "Often eaten during household ceremonies or seasonal gatherings.",
    "servings": "16",
    "totalTime": "30 minutes",
    "prepTime": null,
    "category": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "image": "https://ik.imagekit.io/chompchomp/recipe-hearth-circles_QgmteBXl8c.jpg",
    "slug": "hearth-circles",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g) and 1/2 tsp (2.5 ml) almond extract.",
      "Add 1 1/4 cups (155 g) flour, 1/2 tsp baking powder, and pinch of salt (1 g).",
      "Shape rounds and dust with sugar or cinnamon.",
      "Bake 10–12 minutes."
    ],
    "title": "Hearth Circles",
    "description": "Hearth Circles express the warmth of the home—simple, soft cookies often shared during seasonal rituals. Almond extract gives them nostalgic comfort. [Historical source: \"Hearth Circles\" – Author: Isolde Bernier | Work: Cakes and Crumbs: A Domestic Legacy, 1560]"
  },
  {
    "id": "hildevarts-folly-cakes",
    "category": "Forgotten Cookies",
    "slug": "hildevarts-folly-cakes",
    "totalTime": "35 minutes",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/4 cup (56 g) butter, 1/2 cup (100 g) sugar, and 1/2 cup (120 ml) cream.",
      "Add 1 egg (50 g).",
      "Add 1 1/2 cups (190 g) flour and 1/2 tsp baking powder.",
      "Drop or scoop onto pan.",
      "Bake 15–18 minutes.",
      "Expect collapse; this is normal."
    ],
    "title": "Hildevart’s Folly-Cakes",
    "prepTime": null,
    "cookTime": null,
    "dishType": "Forgotten Cookies",
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 cup (100 g) sugar",
      "1/2 cup (120 ml) cream",
      "1/4 cup (56 g) butter",
      "1 egg (50 g)",
      "1/2 tsp baking powder"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-hildevarts-folly-cakes_J_e6N9IOE.jpg",
    "servings": "12",
    "description": "Folly-Cakes puff proudly in the oven, then settle into gentle concavity as they cool—a flaw that became their identity. [Historical source: \"Hildevart’s Folly Cakes\" – Author: Hildevart Crumb | Work: Folia de Crustis (The Folly of Crusts), 1424]",
    "notes": "A dusting of powdered sugar was traditionally added post-collapse.",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past"
  },
  {
    "id": "honey-ricotta-black-whites",
    "source": "Dolci!",
    "prepTime": null,
    "cookTime": "20 to 25 minutes",
    "totalTime": "45 minutes",
    "notes": null,
    "slug": "honey-ricotta-black-whites",
    "instructions": [
      "Make the cookies",
      "Preheat the oven to 325°F (160°C) and set racks in the upper and lower thirds. Line two baking sheets with parchment paper.",
      "In a medium bowl, whisk the flour, baking powder, and salt. In a stand mixer fitted with the paddle, combine the butter, sugar, and lemon zest. Beat on medium-high speed until the butter is smooth and the mixture resembles wet sand, about 5 minutes. Add the eggs, one at a time, scraping down the sides as needed. Continue beating on medium-high for 1 minute until the batter is light and fluffy. Add the ricotta, honey, and lemon juice. Beat on low until combined, scraping down the sides as needed. The mixture will look curdled, but don't worry!",
      "Add the flour mixture in two parts and mix on low until combined, scraping down the sides after each addition. Increase the speed to medium-high and beat for 30 seconds to make sure the batter is mixed.",
      "Use a 6-tablespoon cookie scoop (⅓ Cup or 2.7 ounces) to portion generous scoops of batter onto the lined baking sheets 3 inches (8 cm) apart (these cookies will spread, so give them space). Bake until the cookies are firm to the touch in the center and slightly golden on the edges, 20 to 25 minutes, switching racks and rotating halfway through. Transfer to a wire rack to cool completely before frosting.",
      "Make the frosting",
      "In a large bowl, combine the corn syrup, 155 grams (⅔ cup) of the heavy cream, and the vanilla. Add the powdered sugar and whisk until the frosting is smooth and very thick.",
      "Divide the frosting between two bowls. To one bowl, add the cocoa powder and the remaining heavy cream. Use a rubber spatula to mix until smooth and thick. Add more corn syrup to each bowl, a teaspoon at a time, for a glossy and spreadable consistency, if needed.",
      "Flip each cookie, flat side up. Starting with the vanilla frosting, use an offset spatula to generously frost half of each cookie, making a distinct line down the center. Clean the offset spatula, then generously frost the other half of each cookie with chocolate, maintaining a clear center line. Return to the wire rack and let set for 1 hour before serving. The frosting will become shinier as it sets.",
      "The black and white cookies can be refrigerated in an airtight container for up to 3 days."
    ],
    "servings": "15 large cookies",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/honey-ricotta-black-whites.jpg",
    "title": "Honey-Ricotta Black & Whites",
    "category": "chomp chomp",
    "description": "The black and white cookie must be the official cookie of NYC. This recipe infuses the zingy lemon cookie base with ricotta and honey for extra sweetness and moisture. Black and whites have always been more cake than cookie, so it only makes sense to swap the pourable glaze or sticky fondant for a rich, spreadable frosting.",
    "ingredients": [
      "FOR THE COOKIES",
      "All-purpose flour 425 grams (3 cups)",
      "Baking powder 10 grams (2 teaspoons)",
      "Fine sea salt 4 grams (1 teaspoon)",
      "Unsalted butter, at room temperature 115 grams (8 tablespoons)",
      "Granulated sugar 400 grams (2 cups)",
      "Grated lemon zest (from 1 lemon) 4 grams (2 teaspoons)",
      "Large eggs, at room temperature 2",
      "Ricotta cheese 425 grams (1¾ cups)",
      "Wildflower honey 20 grams (1 tablespoon)",
      "Fresh lemon juice (from 1 to 2 lemons) 45 grams (3 tablespoons)",
      "FOR THE FROSTING",
      "Light corn syrup, plus more if needed 80 grams (¼ cup)",
      "Heavy cream 155 grams plus 30 grams (⅔ cup plus 2 tablespoons)",
      "Pure vanilla extract 5 grams (1 teaspoon)",
      "Powdered sugar, sifted 660 grams (5½ cups)",
      "Cocoa powder, sifted 25 grams (¼ cup)"
    ]
  },
  {
    "id": "honey-scones",
    "servings": "8",
    "totalTime": "45 minutes",
    "notes": null,
    "dishType": "Scones",
    "prepTime": null,
    "slug": "honey-scones",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/honey-scones.jpg",
    "ingredients": [
      "100g plain wholemeal flour",
      "1 tbsp soft light brown sugar",
      "100g plain white flour",
      "2 tbsp clear honey",
      "2 tsp baking powder",
      "50-75ml milk",
      "Pinch of salt",
      "75g butter, cubed (1/3c)"
    ],
    "cookTime": null,
    "description": "Enjoy the delicate aroma of honey when these scones come out of the oven.",
    "title": "Honey Scones",
    "source": "National Trust Book of Scones",
    "instructions": [
      "Preheat the oven to 200°C. Grease a baking sheet.",
      "Sift the flours, baking powder and salt into a mixing bowl and tip in any bran left in the sieve. Using your fingertips, rub in the butter. Add the sugar and mix.",
      "Mix the honey with the milk and stir until the honey has dissolved. Reserve a little for glazing, add the rest to the flour mixture and mix to make a soft dough.",
      "Place the dough on the baking sheet and, using your hands, shape into a flat round about 18cm in diameter. Using a knife, divide the top into eight wedges without cutting all the way through. Bake for 15-20 minutes until pale golden and springy to the touch.",
      "Remove from the oven. brush the top with the reserved honey and milk mixture and return to the oven for a further 5-10 minutes until golden. Serve warm with butter."
    ],
    "category": "chomp chomp"
  },
  {
    "id": "koekje",
    "prepTime": null,
    "description": "The Dutch Seed of the American Cookie\nKoekjes, the small Dutch butter cookies brought by early settlers, form the linguistic and culinary root of the American “cookie.” Their charm lies in their simplicity: crisp edges, soft centers, and a balanced sweetness that pairs perfectly with coffee or milk. [Historical source: \"Koekje\" – Author: Janneke van Rijswijk | Work: De Smaak der Herinneringen (The Taste of Memories), 1594]",
    "totalTime": "30 minutes",
    "dishType": "Forgotten Cookies",
    "notes": "A  pinch of nutmeg (optional) reflects historical Dutch flavor preferences.",
    "servings": null,
    "category": "Forgotten Cookies",
    "ingredients": [
      "1 cup (125 g) all-purpose flour",
      "1/2 tsp baking powder",
      "1/4 tsp salt",
      "1/2 cup (113 g) unsalted butter, softened",
      "1/2 cup (100 g) granulated sugar",
      "1 egg (50 g)",
      "1 tsp (5 ml) vanilla extract"
    ],
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) softened butter with 1/2 cup (100 g) sugar until pale and smooth.",
      "Add 1 egg (50 g) and 1 tsp (5 ml) vanilla; mix well.",
      "Add 1 cup (125 g) flour, 1/2 tsp baking powder, and 1/4 tsp salt; mix until just combined.",
      "Drop teaspoon-sized portions onto a baking sheet.",
      "Bake 10–12 minutes until lightly golden at edges."
    ],
    "cookTime": null,
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "title": "Koekje",
    "image": "https://ik.imagekit.io/chompchomp/recipe-koekje_8avoVnEhj.jpg",
    "slug": "koekje"
  },
  {
    "id": "koeklings",
    "image": "https://ik.imagekit.io/chompchomp/recipe-koeklings_4oMT_qkkYh.jpg",
    "cookTime": null,
    "totalTime": "20 minutes",
    "ingredients": [
      "1 batch [Koekje dough](https://chompchomp.cc/recipe.html?slug=koekje)",
      "1/4 tsp (1 g) cinnamon",
      "1/4 cup (30 g) finely chopped nuts"
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "notes": "Intended to be small, crisp, and lightly spiced.",
    "slug": "koeklings",
    "category": "Forgotten Cookies",
    "instructions": [
      "Mix cinnamon and 1/4 cup (30 g) nuts into prepared Koekje dough.",
      "Roll into small balls.",
      "Bake 8–9 minutes at 350°F (175°C)."
    ],
    "dishType": "Forgotten Cookies",
    "servings": "30",
    "prepTime": null,
    "title": "Koeklings",
    "description": "Miniature “Children” of the Koekje. [Historical source: \"Koeklings\" – Author: Maria de Groote | Work: Van Koeken tot Koeklings (From Cookies to Koeklings), 1483]"
  },
  {
    "id": "lords-day-chewables",
    "prepTime": null,
    "cookTime": null,
    "category": "Forgotten Cookies",
    "dishType": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "image": "https://ik.imagekit.io/chompchomp/recipe-lords-day-chewables_m2pnkES-E.jpg",
    "notes": "A deliberately modest cookie suited to quiet days.",
    "ingredients": [
      "1 cup (125 g) all-purpose flour",
      "1/4 cup (20 g) oats",
      "1/4 cup (50 g) brown sugar",
      "1/4 cup (85 g) honey",
      "1/4 cup (56 g) butter",
      "1 egg (50 g)"
    ],
    "slug": "lords-day-chewables",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/4 cup (56 g) butter, 1/4 cup (50 g) brown sugar, and 1/4 cup (85 g) honey.",
      "Add 1 egg (50 g).",
      "Add 1 cup (125 g) flour and 1/4 cup (20 g) oats.",
      "Drop spoonfuls on sheet.",
      "Bake 12 minutes."
    ],
    "title": "Lord’s-Day Chewables",
    "description": "Simple, lightly sweet cookies meant to satisfy without indulgence. Their oat texture makes them soothing and wholesome. [Historical source: \"Lord’s Day Chewables\" – Author: Thomas Huxley | Work: Rationes Domesticae (Domestic Rations), 1621]",
    "servings": "12",
    "totalTime": "25 minutes"
  },
  {
    "id": "matcha-amaretti",
    "totalTime": "40 minutes",
    "image": "https://ik.imagekit.io/chompchomp/recipe-matcha-amaretti_g_USKyF8A.jpg",
    "notes": "Make sure to use almond flour, not almond meal.\nAlmond flour has a finer texture and is made with blanched almonds, allowing the bright green color of the matcha to shine. If you can’t find it, you can easily make your own by grinding blanched almonds in a food processor until they are the texture of fine sand. If there are any large pieces of almond still remaining, sift the flour through a fine-mesh sieve to remove them.\nStorage\nThe cookies will keep in an airtight container in a single layer for up to 1 week.",
    "instructions": [
      "Preheat the oven to 325°F and set 2 racks at the upper-middle and lower-middle positions. Line 2 baking sheets with parchment paper or nonstick baking mats.",
      "In a large bowl, combine the almond flour, matcha powder, salt, and 1 cup (200 grams) of the granulated sugar. Whisk until the matcha powder is evenly distributed throughout.",
      "In the bowl of a stand mixer fitted with the whisk attachment, combine the egg whites and almond and vanilla extracts. (Alternatively, use a hand mixer and large bowl.) Mix on medium speed until slightly frothy, 2 to 3 minutes, then increase the speed to high and whip until doubled in volume and stiff peaks form, 1 to 2 minutes more.",
      "Transfer the whipped egg whites to the bowl of dry ingredients and mix with a rubber spatula or with clean hands until a thick dough forms.",
      "Place the remaining ½ cup (100 grams) granulated sugar in a shallow, wide bowl or a plate and the confectioners’ sugar in a second shallow bowl or plate.",
      "Using a medium 1¾-inch (#40) cookie scoop or 2 tablespoons, portion out the dough and roll into balls. Roll a dough ball in the granulated sugar, then in the confectioners’ sugar, then roll in the palms of your hands above the bowl, shaking off any excess confectioners’ sugar. Place the dough balls at least 3 inches apart on the prepared baking sheets (9 per sheet.) Using the bottom of a measuring cup or drinking glass, gently press down the tops of the cookies to flatten them so they are ½ inch thick.",
      "Bake both sheets at the same time, swapping the top sheet to the bottom rack and bottom sheet to the top midway through baking, until the cookies are cracked and just starting to brown on the bottoms, 23 to 26 minutes. Remove from the oven and let cool slightly on the baking sheets, then transfer to a wire rack to cool completely."
    ],
    "description": null,
    "slug": "matcha-amaretti",
    "source": null,
    "prepTime": null,
    "title": "Matcha Amaretti",
    "ingredients": [
      "2⅓ cups (235 grams) almond flour",
      "1 tablespoon (6 grams) matcha powder",
      "¼ teaspoon kosher salt",
      "1½ cups (300 grams) granulated sugar, divided",
      "3 large egg whites, room temperature",
      "1 teaspoon almond extract",
      "2 teaspoons vanilla extract",
      "1 cup (100 grams) confectioners’ sugar"
    ],
    "cookTime": null,
    "category": "chomp chomp",
    "servings": "Makes 18 cookies"
  },
  {
    "id": "mawmaw-walkers-banana-pudding",
    "source": "Aunt Marian",
    "notes": null,
    "prepTime": null,
    "totalTime": "20 minutes",
    "category": null,
    "servings": null,
    "slug": "mawmaw-walkers-banana-pudding",
    "title": "Mawmaw Walker’s Banana Pudding",
    "description": null,
    "cookTime": null,
    "ingredients": [
      "1 1/2 c sugar",
      "4 egg yolks",
      "3 c milk",
      "1/3 c self-rising flour",
      "1 tbsp vanilla extract",
      "4 tbsp butter",
      "1 bag vanilla wafers",
      "1 bunch of bananas"
    ],
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/mawmaw-walkers-banana-pudding.jpg",
    "instructions": [
      "Place cookies and bananas in a bowl in alternating layers.",
      "Whisk together flour and sugar in a large saucepan to combine.",
      "Mix egg yolks with milk.",
      "Add half of the egg & milk mixture to flour mixture. Stir to combine and then add second half. After all has been mixed, add the butter.",
      "Cook over low heat until thickened but still pourable, stirring constantly. Remove from heat and add vanilla extract.",
      "Pour over bananas and cookies.",
      "Top with meringue (optional)."
    ]
  },
  {
    "id": "mercantile-rounds",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "servings": "18",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Combine 1 cup (125 g) flour, 1/2 cup (75 g) cornmeal, and 1/2 cup (100 g) brown sugar.",
      "Add 1/2 cup (113 g) butter and 1 egg (50 g).",
      "Shape into rounds.",
      "Bake 12–14 minutes."
    ],
    "description": "These cookies varied slightly from stall to stall due to inconsistent ingredients. The cornmeal provides a sandy, hearty texture. [Historical source: \"Mercantile Rounds\" – Author: Sebastian Weiss | Work: Commercium et Biscuitum (Trade and Biscuits), 1476]",
    "category": "Forgotten Cookies",
    "dishType": "Forgotten Cookies",
    "slug": "mercantile-rounds",
    "cookTime": null,
    "notes": "Rustic texture and irregular shapes are historically accurate.",
    "title": "Mercantile Rounds",
    "prepTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-mercantile-rounds_kMwXOHc_X.jpg",
    "totalTime": "30 minutes",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (75 g) cornmeal",
      "1/2 cup (100 g) brown sugar",
      "1/2 cup (113 g) butter",
      "1 egg (50 g)"
    ]
  },
  {
    "id": "mirthcakes",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar and 1/2 cup (100 g) brown sugar.",
      "Add 2 eggs (100 g) and 1 tsp (5 ml) vanilla.",
      "Add 1 1/3 cups (165 g) flour, 1/2 tsp baking soda, 1/2 tsp (3 g) salt, nutmeg, and cinnamon.",
      "Fold in 1/2 cup (75 g) dried fruit.",
      "Bake 11–13 minutes."
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "title": "Mirthcakes",
    "description": "Soft, warmly spiced cookies enriched with dried fruit. A tradition at festivals and winter gatherings due to their cheerfully fragrant aroma. [Historical source: \"Mirthcakes\" – Author: Abelard de Beauvoir | Work: La Gâteau des Joies (The Cake of Joys), 1559]",
    "prepTime": null,
    "dishType": "Forgotten Cookies",
    "cookTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-mirthcakes_IcCkBYnkn.jpg",
    "servings": "16",
    "slug": "mirthcakes",
    "notes": "Best served warm during celebrations.",
    "ingredients": [
      "1 1/3 cups (165 g) flour",
      "1/2 tsp baking soda",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) sugar",
      "1/2 cup (100 g) brown sugar",
      "2 eggs (100 g)",
      "1 tsp (5 ml) vanilla",
      "1/2 tsp (1.5 g) nutmeg",
      "1/2 tsp (1.5 g) cinnamon",
      "1/2 cup (75 g) raisins or dried fruit"
    ],
    "category": "Forgotten Cookies",
    "totalTime": "35 minutes"
  },
  {
    "id": "misnomer-cakes",
    "servings": "12",
    "description": "Misnomer Cakes rarely taste like what their name implies. Bright with lemon and lightly crisped at the edges, they surprise anyone expecting something dense or heavy. [Historical source: \"Misnomer Cakes\" – Author: Thomas Nellis | Work: Le Détour de la Confusion (The Turn of Confusion), 1827]",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (100 g) sugar",
      "1/4 cup (56 g) butter",
      "1 egg (50 g)",
      "1/2 tsp (2.5 ml) lemon extract"
    ],
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/4 cup (56 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g) and 1/2 tsp (2.5 ml) lemon extract.",
      "Add 1 cup (125 g) flour; mix until smooth.",
      "Bake 12 minutes."
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-misnomer-cakes_Io6ubZWpF.jpg",
    "dishType": "Forgotten Cookies",
    "totalTime": "25 minutes",
    "title": "Misnomer Cakes",
    "notes": "Historically renamed frequently—none ever stuck.",
    "slug": "misnomer-cakes",
    "prepTime": null,
    "cookTime": null,
    "category": "Forgotten Cookies"
  },
  {
    "id": "monks-embers",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "title": "Monk’s Embers",
    "cookTime": null,
    "slug": "monks-embers",
    "image": "https://ik.imagekit.io/chompchomp/recipe-monks-embers_HvCmgJ65D.jpg",
    "prepTime": null,
    "ingredients": [
      "1 cup (125 g) all-purpose flour",
      "1/2 cup (60 g) rye flour",
      "1/2 tsp (3 g) salt",
      "1/2 tsp baking powder",
      "1/3 cup (75 g) butter",
      "1/3 cup (70 g) dark brown sugar",
      "2 tbsp (30 g) molasses",
      "1 egg (50 g)"
    ],
    "category": "Forgotten Cookies",
    "instructions": [
      "Heat oven to 375°F (190°C).",
      "Cream 1/3 cup (75 g) butter with 1/3 cup (70 g) brown sugar and 2 tbsp (30 g) molasses.",
      "Add 1 egg (50 g).",
      "Add 1 cup (125 g) flour, 1/2 cup (60 g) rye flour, 1/2 tsp baking powder, and 1/2 tsp (3 g) salt.",
      "Shape rounds.",
      "Bake 12–15 minutes."
    ],
    "totalTime": "30 minutes",
    "notes": "Rye flour is essential for the authentic hearthside flavor.",
    "description": "Rye flour, molasses, and dark brown sugar give these cookies a smoky, fire-kissed flavor reminiscent of monastery kitchens. [Historical source: \"Monk’s Embers\" – Author: Brother Galen of Wymondham | Work: De Crustum Monastico (On the Monastic Crust), 1355]",
    "servings": "14"
  },
  {
    "id": "oath-breakers",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "notes": "If someone swears after biting one, the biscuit has fulfilled its destiny.",
    "dishType": "Forgotten Cookies",
    "prepTime": null,
    "totalTime": "1 hour",
    "category": "Forgotten Cookies",
    "servings": "10",
    "slug": "oath-breakers",
    "title": "Oath-Breakers",
    "description": "Oath-Breakers are legendary for their hardness. Traditionally baked for longevity, they softened only when dunked—preferably in something strong. Their name hints at exasperation, challenge, and humor. [Historical source: \"Oath Breakers\" – Author: Gregory del Croix | Work: Le Biscuit de la Colère (The Biscuit of Anger), 1852]",
    "cookTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-oath-breakers_EBVkq5Ers.jpg",
    "ingredients": [
      "2 cups (250 g) flour",
      "1/2 tsp (3 g) salt",
      "2 tbsp (30 g) butter",
      "2/3 cup (160 ml) water"
    ],
    "instructions": [
      "Heat oven to 300°F (150°C).",
      "Mix 2 cups (250 g) flour with 1/2 tsp (3 g) salt and 2 tbsp (30 g) butter.",
      "Add 2/3 cup (160 ml) water to form a very stiff dough.",
      "Roll thick and cut durable shapes.",
      "Bake 35–40 minutes.",
      "Cool completely to achieve full hardness."
    ]
  },
  {
    "id": "oven-wanderers",
    "prepTime": null,
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "image": "https://ik.imagekit.io/chompchomp/recipe-oven-wanderers_q8-yGg0sO.jpg",
    "cookTime": null,
    "category": "Forgotten Cookies",
    "slug": "oven-wanderers",
    "instructions": [
      "Heat oven to 375°F (190°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g), 1/2 cup (120 ml) buttermilk, and 1/2 tsp (1 g) lemon zest.",
      "Add 1 1/2 cups (190 g) flour, 1/2 tsp baking soda, and 1/4 tsp (1 g) salt.",
      "Drop spoonfuls onto a sheet.",
      "Bake 9–11 minutes."
    ],
    "totalTime": "28 minutes",
    "title": "Oven-Wanderers",
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 tsp baking soda",
      "1/4 tsp (1 g) salt",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) sugar",
      "1 egg (50 g)",
      "1/2 cup (120 ml) buttermilk",
      "1/2 tsp (1 g) lemon zest"
    ],
    "servings": "18",
    "dishType": "Forgotten Cookies",
    "notes": "Irregular shape is part of their folklore.",
    "description": "Named for their rippling, wandering appearance, these cookies puff and spread unpredictably. A loose batter produces tender centers and feathery edges. [Historical source: \"Oven Wanderers\" – Author: Guillaume la Flamme | Work: Voyage des Pâtisseries Vagabondes (Journey of the Wandering Pastries), 1385]"
  },
  {
    "id": "pan-rounds-of-reason",
    "prepTime": null,
    "slug": "pan-rounds-of-reason",
    "title": "Pan-Rounds of Reason",
    "totalTime": "30 minutes",
    "notes": "Uniformity is discouraged; each round should have its own logic.",
    "category": "Forgotten Cookies",
    "ingredients": [
      "1 1/4 cups (155 g) flour",
      "1/4 cup (30 g) rye flour",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) butter",
      "1/4 cup (85 g) honey"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-pan-rounds-of-reason_kYA_TkOi6.jpg",
    "servings": "10",
    "description": "Pan-Rounds of Reason earned their name from monastic scribes baffled by their inconsistent shapes. Honey-sweetened and rustic, they are intended to be irregular. [Historical source: \"Pan Rounds of Reason\" – Author: Catherine Faulkner | Work: La Raison des Ronds (The Reason of the Rounds), 1813]",
    "cookTime": null,
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "instructions": [
      "Heat oven to 375°F (190°C).",
      "Mix 1/2 cup (113 g) butter with 1/4 cup (85 g) honey.",
      "Add 1 1/4 cups (155 g) flour, 1/4 cup (30 g) rye flour, and 1/2 tsp (3 g) salt.",
      "Drop loose rounds onto pan.",
      "Bake 12 minutes."
    ]
  },
  {
    "id": "pezzetti-di-cannella",
    "notes": null,
    "cookTime": null,
    "category": null,
    "prepTime": null,
    "totalTime": null,
    "description": "My mother's friend Yolanda Tateo shared her mother's recipe for these cookies. Yolanda moved to the United States from Sava (Puglia) when she was in her twenties. This is one of the few recipes from home that she has kept over the years. These bite-sized cookies are perfect to have on hand for visitors or to enjoy with a cup of coffee or tea. It's worth splurging on good-quality cinnamon because it is the predominant flavoring. The recipe makes a lot of cookies; they can be stored for up to a month in an airtight container.",
    "slug": "pezzetti-di-cannella",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/pezzetti-di-cannella.jpg",
    "source": null,
    "instructions": [
      "Preheat the oven to 350°F (177°C) with racks in the upper and lower thirds of the oven. Line two baking sheets with parchment paper or silicone baking mats.",
      "Sift the flour, sugar, cocoa, cinnamon, and baking powder into a large bowl. Make a well in the center and add the eggs, oil, milk, and lemon zest. Mix the wet ingredients into the flour mixture with a fork until the flour is mostly incorporated, then continue by kneading with your hands in the bowl until the dough comes together into a smooth ball. Cover and set aside for 30 minutes.",
      "Divide the dough into four pieces. Take one piece and, using a bit of flour if needed, roll it with your hands on a flat surface to form a rope about ⅝ inch wide. Press down to slightly flatten the rope, then cut it on the diagonal into 1-inch diamond-shaped pieces. Arrange the cookies on the prepared baking sheets with an inch between them. Repeat to form cookies with the remaining three pieces of dough. (I form half of the cookies, then bake them while I form the second half.)",
      "Bake until the cookies are puffed and firm to the touch, 10 to 12 minutes. Transfer the pans to wire racks until the cookies are completely cool, at least 1 hour.",
      "To glaze the cookies, in a wide, shallow bowl large enough to hold all the cookies, use a whisk to stir the confectioners' sugar and lemon juice together to form a thick, smooth glaze. If the glaze is too thin, add a bit more sugar. Line two baking sheets with parchment paper. Put all of the cookies into the glaze at once and use your hands to coat them on all sides. Transfer the cookies one at a time to the prepared baking sheets-the glaze should cling to the cookies without pooling on the sheet. Let the cookies stand until the glaze is completely dry, which can take up to 24 hours, before packing them into an airtight container."
    ],
    "ingredients": [
      "### Cookies",
      "2 cups (264 g) all-purpose flour, plus more for rolling",
      "½ cup (100 g) granulated sugar",
      "2 tablespoons unsweetened Dutch-processed cocoa powder",
      "1 tablespoon ground cinnamon",
      "2 teaspoons baking powder",
      "2 large eggs",
      "1/4 cup (60 ml) safflower or other neutral-tasting vegetable oil",
      "2 tablespoons whole milk",
      "Finely grated zest of 1 lemon",
      "### Glaze",
      "2 cups (250 g) confectioners' sugar, plus more as needed",
      "5 tablespoons (75 ml) fresh lemon juice"
    ],
    "title": "Pezzetti di Cannella",
    "servings": "Makes 120 bite-sized cookies"
  },
  {
    "id": "pilgrims-stoics",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "notes": "Satisfying to eat slowly—almost contemplative.",
    "prepTime": null,
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g), 1 tbsp (15 ml) milk, and 1 tsp (5 ml) vanilla.",
      "Add 1 3/4 cups (220 g) flour, 1/4 cup (30 g) whole wheat flour, 1/2 tsp baking powder, and 1/2 tsp (3 g) salt.",
      "Press into thick slab; cut squares.",
      "Bake 16–20 minutes."
    ],
    "title": "Pilgrim’s Stoics",
    "cookTime": null,
    "ingredients": [
      "1 3/4 cups (220 g) flour",
      "1/4 cup (30 g) whole wheat flour",
      "1/2 tsp baking powder",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) sugar",
      "1 egg (50 g)",
      "1 tbsp (15 ml) milk",
      "1 tsp (5 ml) vanilla"
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-pilgrims-stoics_7BX3q69ua.jpg",
    "description": "Intentionally firm biscuits meant for slow, meditative chewing—perfect for travelers and walkers. Whole wheat adds depth and durability. [Historical source: \"Pilgrim’s Stoics\" – Author: Sister Marguerite of the Abbey of Saint-Pierre | Work: De Pastris Monasterii (Of the Monastery Pastries), 1380]",
    "category": "Forgotten Cookies",
    "totalTime": "40 minutes",
    "slug": "pilgrims-stoics",
    "servings": "12"
  },
  {
    "id": "russian-spice-cookies-pryaniki",
    "prepTime": "15min",
    "slug": "russian-spice-cookies-pryaniki",
    "totalTime": "90 minutes",
    "title": "Russian Spice Cookies (Pryaniki)",
    "notes": "**Serving size** 3 dozen (12 servings)\n**Calories** 183 kcal\n**Fat** 4 g\n**Saturated fat** 2 g\n**Unsaturated fat** 0 g\n**Cholesterol** 37 mg\n**Sodium** 95 mg\n**Carbohydrates** 34 g\n**Fiber** 1 g\n**Sugar** 19 g\n**Protein** 3 g",
    "category": "chomp chomp",
    "ingredients": [
      "3 cups/450 g flour (all-purpose)",
      "3 teaspoons baking powder",
      "1/2 teaspoon cardamom",
      "1/2 teaspoon cinnamon",
      "1/2 teaspoon ginger",
      "1/4 to 1/2 teaspoon cloves (or to taste)",
      "Optional: 1/2 teaspoon nutmeg",
      "Optional: 1/2 teaspoon allspice",
      "1/8 teaspoon salt",
      "2 large egg yolks",
      "1 large egg",
      "1 large egg",
      "3 ounces/85 g butter (unsalted, melted)",
      "3/4 cup/265 g honey or ​ agave syrup",
      "3/4 cup/265 g honey or ​ agave syrup",
      "1/2 cup/110 g confectioners' sugar",
      "1 to 2 tablespoons water"
    ],
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/russian-spice-cookies-pryaniki.jpg",
    "servings": "4 dozen",
    "description": "This traditional recipe for Russian spice cookies or pryaniki is traditionally served with hot tea, sbiten, or chai, especially at Christmas time.",
    "cookTime": "12min",
    "source": "[thespruceeats.com](https://www.thespruceeats.com/russian-spice-cookies-pryaniki-recipe-1137299)",
    "dishType": "Cookies",
    "instructions": [
      "### Make the Cookie Dough",
      "Gather the ingredients.",
      "In a medium bowl, sift together flour, baking soda, cardamom, cinnamon, ginger, cloves, optional nutmeg, optional allspice, and salt. Set aside.",
      "In a large bowl, beat together the egg yolks , the whole egg, granulated sugar, butter, honey or agave syrup, and vanilla. If using agave syrup, bake 25 degrees lower (325 F) because the cookies will brown faster.",
      "Mix in the dry ingredients into the wet ingredients until well combined. Cover with plastic wrap and refrigerate for 1 hour.",
      "Position a rack in the upper and lower portion of the oven and heat to 350 F. Using a 1 tablespoon cookie scoop, portion out mounds of dough and roll them in your hands until they are a completely smooth ball. Place 2-inches apart on parchment-lined cookie sheets. They will flatten out somewhat as they bake but still retain a domed shape.",
      "Bake until just golden, rotating the sheets halfway through for even baking, 10 to 14 minutes. Cool on the sheets until the cookies firm slightly. Transfer to racks to finish cooling.",
      "### Make the Glaze",
      "Gather the ingredients.",
      "In a medium bowl, whisk together the confectioners’ sugar and enough water to form a thin icing.",
      "Spread on cooled cookies with a pastry brush.",
      "Allow icing to harden before serving."
    ]
  },
  {
    "id": "scribes-regret",
    "slug": "scribes-regret",
    "totalTime": "25 minutes",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "instructions": [
      "Heat oven to 325°F (165°C).",
      "Cream 1 cup (226 g) very soft butter with 1/2 cup (60 g) powdered sugar.",
      "Add 1 tsp (5 ml) vanilla.",
      "Add 1 cup (125 g) flour and 1/4 tsp (1 g) salt; mix gently.",
      "Shape walnut-sized balls and flatten slightly.",
      "Bake 14–16 minutes."
    ],
    "title": "Scribe’s Regret",
    "dishType": "Forgotten Cookies",
    "description": "These tender, fragile cookies earned their name in monastic scriptoria, where even a single bite could send crumbs drifting onto precious parchment. Despite the nuisance, their rich delicacy made them beloved. [Historical source: \"Scribe’s Regret\" – Author: Brother Eligius of Chartres | Work: Liber Scribentis de Crusts (The Scribe’s Book of Crusts), c. 1205]",
    "cookTime": null,
    "servings": "14",
    "notes": "The softer the butter, the more crumb-prone the cookie.",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (60 g) powdered sugar",
      "1 tsp (5 ml) vanilla extract",
      "1 cup (226 g) very soft butter",
      "1/4 tsp (1 g) salt"
    ],
    "category": "Forgotten Cookies",
    "prepTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-scribes-regret_l22aaLddH.jpg"
  },
  {
    "id": "ships-stones",
    "prepTime": null,
    "cookTime": null,
    "category": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "dishType": "Forgotten Cookies",
    "image": "https://ik.imagekit.io/chompchomp/recipe-ships-stones_xUY3L_Y11.jpg",
    "notes": "True to the name—these were famously hard and durable.",
    "ingredients": [
      "2 cups (250 g) flour",
      "1/2 tsp (3 g) salt",
      "2 tbsp (25 g) sugar",
      "1/2 cup (120 ml) water"
    ],
    "slug": "ships-stones",
    "instructions": [
      "Mix 2 cups (250 g) flour, 1/2 tsp (3 g) salt, and 2 tbsp (25 g) sugar.",
      "Add 1/2 cup (120 ml) water to form stiff dough.",
      "Roll thick; cut rounds.",
      "Bake at 325°F (165°C) for 30 minutes.",
      "Flip; bake 10–15 minutes more."
    ],
    "title": "Ship’s Stones",
    "description": "Hard Biscuits of the Open Sea. [Historical source: \"Ship’s Stones\" – Author: Captain Edmund Dorrington | Work: Sailor’s Bread and Biscuit Lore, 1703]",
    "servings": "12",
    "totalTime": "50 minutes"
  },
  {
    "id": "smalls-of-uncertain-texture",
    "category": "Forgotten Cookies",
    "servings": "20",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (50 g) almond flour",
      "1/2 tsp baking powder",
      "1/4 tsp (1 g) salt",
      "1/3 cup (75 g) butter",
      "1/3 cup (65 g) sugar",
      "1/3 cup (65 g) brown sugar",
      "1 egg (50 g)",
      "1 tbsp (15 ml) cream"
    ],
    "slug": "smalls-of-uncertain-texture",
    "totalTime": "30 minutes",
    "title": "Smalls of Uncertain Texture",
    "notes": "Textural inconsistency is traditional and expected.",
    "description": "Neither fully crisp nor definitively soft, these cookies hover in an in-between texture that sparked arguments among bakers. Almond flour lends tenderness without structure. [Historical source: \"Smalls of Uncertain Texture\" – Author: Henrietta Valcourt | Work: De Douteux Textures et Pâtisseries (On Doubtful Textures and Pastries), 1725]",
    "dishType": "Forgotten Cookies",
    "cookTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-smalls-of-uncertain-texture_SX4sC2L7B.jpg",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/3 cup (75 g) butter with 1/3 cup (65 g) sugar and 1/3 cup (65 g) brown sugar.",
      "Add 1 egg (50 g) and 1 tbsp (15 ml) cream.",
      "Add 1 cup (125 g) flour, 1/2 cup (50 g) almond flour, 1/2 tsp baking powder, and 1/4 tsp (1 g) salt.",
      "Form thick coins.",
      "Bake 12–15 minutes depending on desired texture."
    ],
    "prepTime": null
  },
  {
    "id": "softlings",
    "slug": "softlings",
    "totalTime": "30 minutes",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "instructions": [
      "Preheat oven to 325°F (165°C).",
      "In a large mixing bowl, cream together 1/2 cup (115 g) unsalted butter and 1/3 cup (65 g) powdered sugar until smooth and light.",
      "Stir in 1 tsp (5 ml) vanilla extract and 1/4 tsp (1 g) salt.",
      "Gradually add 1 1/2 cups (190 g) all-purpose flour, mixing until the dough just comes together.",
      "Roll the dough into small balls, about 1 inch (2.5 cm) in diameter, and place them on a baking sheet lined with parchment paper.",
      "Flatten each ball gently with the back of a spoon or your fingers, creating a disc shape.",
      "Bake for 12–15 minutes, or until the edges are just beginning to turn golden.",
      "Allow the cookies to cool on the baking sheet for 5 minutes before transferring them to a wire rack to cool completely."
    ],
    "dishType": "Forgotten Cookies",
    "title": "Softlings",
    "description": "Softlings are a short-lived category of cookies, known for their extreme tenderness. These delicate treats melt in your mouth, but their fragility means they are best enjoyed fresh and quickly, before they lose their shape. They are rich, buttery, and lightly sweet, with a texture that defies their brief existence in the world of baked goods. [Historical source: \"Softlings\" – Author: Valeria Doran | Work: Les Pâtisseries de l’Incertitude (Pastries of Uncertainty), 1904]",
    "cookTime": null,
    "servings": "8",
    "notes": "Softlings are best enjoyed immediately, as their texture is incredibly delicate and soft, and they will not retain their form for long after baking. Pair them with tea or a light dessert wine for an indulgent treat.",
    "ingredients": [
      "1 1/2 cups (190 g) all-purpose flour",
      "1/2 cup (115 g) unsalted butter, softened",
      "1/3 cup (65 g) powdered sugar",
      "1 tsp (5 ml) vanilla extract",
      "1/4 tsp (1 g) salt"
    ],
    "category": "Forgotten Cookies",
    "prepTime": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-softlings_2ZLBzyouq.jpg"
  },
  {
    "id": "spiced-rum-syrup",
    "totalTime": "45 minutes",
    "notes": "Substitute 1/4 teaspoon rum extract for rum, if desired.\n\nPourable over grilled pineapple. Also delicious over broiled grapefruit.",
    "instructions": [
      "Stir all ingredients together, except vanilla and rum, in a 2 1/2 quart saucepan. Bring to a boil over medium heat, stirring constantly.",
      "Reduce heat and gently boil for 40 minutes or until mixture reduces down to 1 cup.",
      "Strain out spices and stir in vanilla and rum."
    ],
    "ingredients": [
      "1 cup packed dark brown sugar",
      "1 1/2 cups water",
      "8 whole cloves",
      "1 whole star anise",
      "1 (2 inch) whole cinnamon stick",
      "1/8 teaspoon ground nutmeg",
      "1/4 teaspoon ground allspice",
      "4 whole black peppercorns",
      "1 (2 inch) fresh orange peel",
      "1/4 teaspoon vanilla extract",
      "1 to 2 tablespoons spiced rum (or 1/4 tsp rum extract)"
    ],
    "source": "[dominosugar.com](https://www.dominosugar.com/recipe/spiced-rum-syrup)",
    "prepTime": null,
    "slug": "spiced-rum-syrup",
    "servings": "1 cup",
    "title": "Spiced Rum Syrup",
    "category": "Community",
    "dishType": "Syrups",
    "description": "This spiced rum syrup distills a pantry of globally traveled aromatics—clove, anise, cinnamon, nutmeg, allspice, pepper—into a concentrated sweetness, recalling the colonial-era logic of sugar as both preservative and luxury. Brown sugar and rum anchor the syrup in the Caribbean sugar trade, while citrus peel and vanilla lend a perfumed warmth that feels at once domestic and faintly illicit, a reminder that everyday indulgences often carry long histories of distance and desire.\n\n“Taken directly from Domino Sugar website, it’s what I’m making this morning. I put it in coffee and I’ve used it in ice cream. Delicious.” [Submitted by Jason]",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/spiced-rum-syrup.jpg",
    "cookTime": null
  },
  {
    "id": "sweet-rounds-for-the-road",
    "category": "Forgotten Cookies",
    "cookTime": null,
    "description": "These fragrant cakes were traditionally offered to travelers. Lemon zest and honey convey hopes for brightness and safe passage. [Historical source: \"Sweet Rounds for the Road\" – Author: Richard Hayward | Work: The Baker’s Gift to the Road (Gifts for the Weary Traveler), 1702]",
    "servings": "12",
    "image": "https://ik.imagekit.io/chompchomp/recipe-sweet-rounds-for-the-road_1cTip4D36.jpg",
    "ingredients": [
      "1 1/4 cups (155 g) flour",
      "1/2 tsp baking powder",
      "1/4 tsp (1 g) salt",
      "1/2 cup (113 g) butter",
      "1/3 cup (65 g) sugar",
      "1 egg (50 g)",
      "2 tbsp (42 g) honey",
      "Zest of 1 lemon (about 1 tbsp / 6 g)"
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "notes": "A traditional parting gift—best when shared warm.",
    "title": "Sweet Rounds for the Road",
    "prepTime": null,
    "totalTime": "30 minutes",
    "slug": "sweet-rounds-for-the-road",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/3 cup (65 g) sugar.",
      "Add 1 egg (50 g) and 2 tbsp (42 g) honey.",
      "Add 1 1/4 cups (155 g) flour, 1/2 tsp baking powder, 1/4 tsp (1 g) salt, and lemon zest (6 g).",
      "Form small discs.",
      "Bake 10–12 minutes."
    ],
    "dishType": "Forgotten Cookies"
  },
  {
    "id": "the-best-sugar-cookies",
    "slug": "the-best-sugar-cookies",
    "servings": "Yield: 24 4-inch cookies",
    "instructions": [
      "Whisk the flour, baking powder, and salt together in a medium bowl. Set aside.",
      "In a large bowl using a hand mixer or a stand mixer fitted with a paddle attachment, beat the butter and sugar together on high speed until completely smooth and creamy, about 2 minutes. Add the egg, vanilla, and almond extract (if using) and beat on high speed until combined, about 1 minute. Scrape down the sides and up the bottom of the bowl and beat again as needed to combine.",
      "Add the dry ingredients to the wet ingredients and mix on low until combined. Dough will be relatively soft. If the dough seems too soft and sticky for rolling, add 1 more Tablespoon of flour.",
      "Divide the dough into 2 equal parts. Place each portion onto a piece of lightly floured parchment paper or a lightly floured silicone baking mat. With a lightly floured rolling pin, roll the dough out to about 1/4-inch thickness. Use more flour if the dough seems too sticky. The rolled-out dough can be any shape, as long as it is evenly 1/4-inch thick.",
      "Lightly dust one of the rolled-out doughs with flour. Place a piece of parchment on top. (This prevents sticking.) Place the 2nd rolled-out dough on top. Cover with plastic wrap or aluminum foil, then refrigerate for at least 1-2 hours and up to 2 days.",
      "Once chilled, preheat oven to 350°F (177°C). Line 2-3 large baking sheets with parchment paper or silicone baking mats. Carefully remove the top dough piece from the refrigerator. If it’s sticking to the bottom, run your hand under it to help remove it– see me do this in the video above. Using a cookie cutter, cut the dough into shapes. Re-roll the remaining dough and continue cutting until all is used. Repeat with 2nd piece of dough. (Note: It doesn’t seem like a lot of dough, but you get a lot of cookies from the dough scraps you re-roll.)",
      "Arrange cookies on baking sheets 3 inches apart. Bake for 11-12 minutes or until lightly browned around the edges. If your oven has hot spots, rotate the baking sheet halfway through bake time. Allow cookies to cool on the baking sheet for 5 minutes then transfer to a wire rack to cool completely before decorating.",
      "Decorate the cooled cookies with royal icing or my easy glaze icing. Feel free to tint either icing with gel food coloring. See post above for recommended decorating tools. No need to cover the decorated cookies as you wait for the icing to set. If it’s helpful, decorate the cookies directly on a baking sheet so you can stick the entire baking sheet in the refrigerator to help speed up the icing setting.",
      "Enjoy cookies right away or wait until the icing sets to serve them. Once the icing has set, these cookies are great for gifting or for sending. Plain or decorated cookies stay soft for about 5 days when covered tightly at room temperature. For longer storage, cover and refrigerate for up to 10 days."
    ],
    "ingredients": [
      "2 and 1/4 cups (281g) all-purpose flour (spoon & leveled)",
      "1/2 teaspoon baking powder",
      "1/4 teaspoon salt",
      "3/4 cup (170g) unsalted butter, softened to room temperature",
      "3/4 cup (150g) granulated sugar",
      "1 large egg, at room temperature",
      "2 teaspoons pure vanilla extract",
      "1/4 or 1/2 teaspoon almond extract (optional, but makes the flavor outstanding)*",
      "Royal Icing or Easy Glaze Icing"
    ],
    "notes": "Sugar Cookies Video Tutorial: (https://youtu.be/f24gpOgAXwY)\nFreezing Instructions: Plain or decorated sugar cookies freeze well up to 3 months. Wait for the icing to set completely before layering between sheets of parchment paper in a freezer-friendly container. To thaw, thaw in the refrigerator or at room temperature. You can also freeze the cookie dough for up to 3 months before rolling it out. Prepare the dough through step 3, divide in half, flatten both halves into a disk as we do with pie crust, wrap each in plastic wrap, then freeze. To thaw, thaw the disks in the refrigerator, then bring to room temperature for about 1 hour. Roll out the dough as directed in step 4, then chill rolled out dough in the refrigerator for 45 minutes – 1 hour before cutting into shapes and baking.\nRoom Temperature: Room temperature butter is essential. If the dough is too sticky, your butter may have been too soft. Room temperature butter is actually cool to the touch. You can read more about it in this post. Room temperature egg is preferred so it’s quickly and evenly mixed into the cookie dough.\nFlavors: I love flavoring this cookie dough with 1/2 teaspoon almond extract as listed in the ingredients above. For lighter flavor, use 1/4 teaspoon. Instead of the almond extract, try using 1 teaspoon of maple extract, coconut extract, lemon extract, or peppermint extract. Or add 1 teaspoon pumpkin pie spice or ground cinnamon. Along with lemon extract, you can also add 1 Tablespoon lemon zest.\nIcing: Use royal icing or my easy glaze icing. See post above to read about the differences.\nBe sure to check out my top 5 cookie baking tips AND these are my 10 must-have cookie baking tools.",
    "category": null,
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/the-best-sugar-cookies.jpg",
    "totalTime": null,
    "source": "[sallysbakingaddiction.com](https://sallysbakingaddiction.com/best-sugar-cookies/)",
    "prepTime": "2 hours",
    "title": "The Best Sugar Cookies",
    "description": null,
    "cookTime": "12 minutes"
  },
  {
    "id": "the-ultimate-sticky-toffee-pudding",
    "category": "chomp chomp",
    "description": "A bowl of dark, delicious Sticky toffee pudding with its treacle, date-laden sponge, and thick toffee sauce is perhaps one of England's most popular puddings even though it was unheard of before 1984.\nThe origins of this popular dish are the cause of many arguments of who made the first one, though favor falls often at the feet of Sharrow Bay Hotel in the Lake District of North West England as the originators.\nThe pudding is easy to make and can be cooked and eaten immediately. Or, following the instructions below, you can make it in advance and soak with the sauce for an even stickier pudding.\nTraditionally, a sticky toffee pudding is made in a large square tin and served cut into squares.",
    "totalTime": "90 minutes",
    "source": "[thespruceeats.com](https://www.thespruceeats.com/sticky-toffee-pudding-recipe-435711)",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/the-ultimate-sticky-toffee-pudding.jpg",
    "servings": "6",
    "notes": "The puddings can be made a day or two in advance, placed in an ovenproof dish and drenched with the sauce. Cover the dish loosely with aluminum foil and store until needed. Reheat for 20 minutes in a hot oven, 160C/325F/Gas 3, or until the sauce is bubbling nicely. Serve with custard or ice cream.\nThe puddings drenched in the sauce also freeze well. Reheat as above.\nGuidelines (per serving)\n732 Calories 39g Fat 93g Carbs 7g Protein\nNutrition Facts\nAmount per serving\nCalories 732\n% Daily Value*\nTotal Fat 39g 50%\nSaturated Fat 22g 112%\nCholesterol 165mg 55%\nSodium 688mg 30%\nTotal Carbohydrate 93g 34%\nDietary Fiber 4g 13%\nProtein 7g\nCalcium 172mg 13%\n*The % Daily Value (DV) tells you how much a nutrient in a food serving contributes to a daily diet. 2,000 calories a day is used for general nutrition advice.",
    "dishType": "Pudding",
    "cookTime": "50 mins",
    "instructions": [
      "Gather the ingredients.",
      "Preheat the oven to 160 C / 325 F / Gas 3.",
      "Butter 6 (200 ml) individual pudding tins or use an 8-by-8-by-2 1/2-inch square baking dish and dust lightly with flour.",
      "Put the chopped dates into a large glass bowl, cover with boiling water, leave for 20 minutes to swell and soften. Once soft, add the vanilla extract.",
      "Sieve the flour and bicarbonate of soda into a large baking bowl.",
      "In another baking bowl, cream the butter and sugar together until light and creamy, don't worry about grains of sugar, they will melt during cooking.",
      "Little by little, add the beaten eggs, mixing really well between additions. Add the treacle and beat well.",
      "Using a large metal spoon carefully fold in one-third of the flour, then carefully stir in one-third of the milk. Repeat until all the flour and milk is used up.",
      "Add the chopped dates (including any liquid in the bowl) and stir gently. The pudding mixture will resemble a thick batter.",
      "Divide the mixture between the six pudding tins and place on a baking sheet.",
      "Bake in the preheated oven for 20 to 25 minutes for individual puddings or 45 to 50 minutes for the large square. The cake should be raised and firm to the touch. If not, cook a little longer, but take care not to burn. Once ready, remove from the oven and leave to cool in the tins for 10 minutes before turning out.",
      "Over medium heat, melt the butter, sugar and half the cream in a saucepan. Raise the heat slightly and bring to the boil stirring constantly until all the sugar has dissolved.",
      "Add the treacle and allow the sauce to bubble for 2 minutes. Remove from the heat and leave to cool for 1 minute then stir in the remaining cream.",
      "Place a portion of the cake onto warm individual serving dishes, and drizzle generous amounts of sauce over.",
      "Serve with custard or ice cream."
    ],
    "title": "The Ultimate Sticky Toffee Pudding",
    "ingredients": [
      "### For the Pudding:",
      "225 grams/8 ounces cooking dates (stoned and chopped small)",
      "175 milliliters/6 fluid ounces water (boiling)",
      "1 teaspoon vanilla extract",
      "175 grams/6 ounces self-raising flour",
      "1 teaspoon bicarbonate of soda",
      "2 large, fresh eggs (lightly beaten)",
      "85 grams/3 ounces butter (softened, plus extra for greasing)",
      "140 grams/5 ounces demerara sugar",
      "2 tablespoon black treacle",
      "100 milliliters/3 1/2 fluid ounces milk",
      "### For the Sauce:",
      "175 grams/6 ounces light muscovado sugar",
      "55 grams/2 ounces butter (cut into pieces)",
      "225 milliliters/8 ounces heavy (double) cream",
      "1 tablespoon black treacle"
    ],
    "prepTime": "40 mins",
    "slug": "the-ultimate-sticky-toffee-pudding"
  },
  {
    "id": "tidings",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "totalTime": "30 minutes",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/3 cup (110 g) honey.",
      "Add 1 egg (50 g) and 1/2 tsp (2.5 ml) almond extract.",
      "Add 1 cup (125 g) flour, 1/2 cup (50 g) oat flour, 1/2 tsp baking powder, and 1/4 tsp (1 g) salt.",
      "Shape into small rounds.",
      "Bake 10–12 minutes."
    ],
    "category": "Forgotten Cookies",
    "cookTime": null,
    "servings": "18",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (50 g) oat flour (or finely ground oats)",
      "1/2 tsp baking powder",
      "1/4 tsp (1 g) salt",
      "1/2 cup (113 g) butter",
      "1/3 cup (110 g) honey",
      "1 egg (50 g)",
      "1/2 tsp (2.5 ml) almond extract"
    ],
    "slug": "tidings",
    "description": "Historically given alongside important messages, Tidings cookies softened the delivery of news. Honey and almond give them a warm, festive character. [Historical source: \"Tidings\" – Author: Marcellus de la Tour | Work: Panis Nuntius (Bread of the Messenger), 1580]",
    "prepTime": null,
    "notes": "Traditionally topped with a single almond to signify “good news.”",
    "dishType": "Forgotten Cookies",
    "image": "https://ik.imagekit.io/chompchomp/recipe-tidings_qV58KdU1C.jpg",
    "title": "Tidings"
  },
  {
    "id": "travelers-flats",
    "category": "Forgotten Cookies",
    "cookTime": null,
    "servings": "18–20",
    "description": "Traveler’s Flats are practical, lightly sweet biscuits designed for portability and barter. Their firm texture and simple flavor made them reliable companions on long routes. [Historical source: \"Traveler’s Flats\" – Author: Georgius von Lindenberg | Work: Panis Viatoris (The Traveler’s Bread), 1357]",
    "image": "https://ik.imagekit.io/chompchomp/recipe-travelers-flats_b6-7EA9n2.jpg",
    "ingredients": [
      "1 1/2 cups (190 g) all-purpose flour",
      "1/2 tsp baking powder",
      "1/2 tsp (3 g) salt",
      "1/2 cup (113 g) melted butter",
      "3/4 cup (150 g) sugar",
      "1 egg (50 g)",
      "1 tsp (5 ml) vanilla extract",
      "Water as needed (up to 1–2 tbsp / 15–30 ml)"
    ],
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "title": "Traveler’s Flats",
    "notes": "Originally used as bartering snacks by travelers.",
    "prepTime": null,
    "totalTime": "30 minutes",
    "slug": "travelers-flats",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/2 cup (113 g) melted butter with 3/4 cup (150 g) sugar.",
      "Add 1 egg (50 g) and 1 tsp (5 ml) vanilla.",
      "Add 1 1/2 cups (190 g) flour, 1/2 tsp baking powder, and 1/2 tsp (3 g) salt.",
      "Add 15–30 ml water only if dough is too stiff.",
      "Form 1/4-inch discs.",
      "Bake 12–14 minutes."
    ],
    "dishType": "Forgotten Cookies"
  },
  {
    "id": "twice-baked-wafers",
    "cookTime": null,
    "slug": "twice-baked-wafers",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "servings": "24 wafers",
    "image": "https://ik.imagekit.io/chompchomp/recipe-twice-baked-wafers_zg8HodzKG.jpg",
    "prepTime": null,
    "dishType": "Forgotten Cookies",
    "category": "Forgotten Cookies",
    "title": "Twice-Baked Wafers",
    "totalTime": "45 minutes",
    "instructions": [
      "Heat oven to 325°F (165°C).",
      "Mix 1 cup (125 g) flour, 1/2 cup (100 g) sugar, and 1/4 tsp (1 g) salt.",
      "Whisk 2 egg whites (60 g) until frothy; fold into mixture.",
      "Add 2 tbsp (30 ml) melted butter.",
      "Spread into thin rounds.",
      "Bake 12 minutes, cool briefly.",
      "Bake again for 5–6 minutes for crispness."
    ],
    "description": "Crisp, Delicate, and Long-Lasting. [Historical source: \"Twice Baked Wafers\" – Author: Alistair Crabb | Work: Navis Vitale (The Ship of Life), 1542]",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (100 g) sugar",
      "1/4 tsp (1 g) salt",
      "2 egg whites (60 g)",
      "2 tbsp (30 ml) melted butter"
    ],
    "notes": "The second bake defines their texture."
  },
  {
    "id": "twice-browned-resentments",
    "prepTime": null,
    "servings": "12",
    "notes": "The second bake deepens color and strengthens texture.",
    "category": "Forgotten Cookies",
    "totalTime": "35 minutes",
    "slug": "twice-browned-resentments",
    "title": "Twice-Browned Resentments",
    "cookTime": null,
    "dishType": "Forgotten Cookies",
    "description": "A cookie baked, cooled, and baked again—its name nods to the domestic irritation that supposedly inspired the technique. The double bake produces a firm, caramel-toned texture. [Historical source: \"Twice Browned Resentments\" – Author: Jean-Paul Lemoine | Work: Le Pain et la Colère (The Bread and the Wrath), 1822]",
    "ingredients": [
      "1 1/2 cups (190 g) flour",
      "1/2 cup (113 g) butter",
      "1/2 cup (100 g) brown sugar",
      "1 egg (50 g)",
      "1/2 tsp baking powder",
      "1/4 tsp (1 g) salt"
    ],
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Cream 1/2 cup (113 g) butter with 1/2 cup (100 g) brown sugar.",
      "Add 1 egg (50 g).",
      "Add 1 1/2 cups (190 g) flour, 1/2 tsp baking powder, and 1/4 tsp (1 g) salt.",
      "Scoop into rounds and bake 12 minutes.",
      "Cool slightly, then bake 10 minutes more."
    ],
    "image": "https://ik.imagekit.io/chompchomp/recipe-twice-browned-resentments_mcvywf1h9.jpg",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past"
  },
  {
    "id": "ube-brle",
    "instructions": [
      "Add the butter to your food processor or to the bowl of a stand mixer fitted with a paddle attachment and mix on a medium speed for 20 seconds until the butter starts to get creamy. Add both types of sugar and mix for 1½-2 minutes until the sugar is well mixed into the butter. Scrape the butter down from the sides of the bowl at 30-second intervals. The mixture should be fairly light in colour and with no visible sugar crystals.",
      "Add the egg and ube extract and mix for 20 seconds until they are just combined. Make sure you don't mix for too long - it's fine if it's still a little unmixed.",
      "Combine the flour, baking powder, bicarbonate of soda, salt and ube powder in a separate bowl. Add the dry ingredients to the butter mixture in two batches, mixing for 15 seconds between each batch until everything is just combined. Scrape the bowl between mixing. Add the white chocolate and mix briefly.",
      "Scoop 65g (2¼oz) balls of dough using an ice cream scoop, or roll balls using 2 tablespoons of dough. (Size 24 scoop is good.) There should be enough to make about 12 cookies. Place the dough balls in a container with a lid or on a tray that you then cover with cling film (plastic wrap). Leave to rest in the refrigerator for at least 3 hours - preferably overnight.",
      "Preheat the oven to 160°C fan (180°C/350°F/gas 4).",
      "Place the dough balls approximately 5cm (2in) apart on baking trays lined with baking parchment. Bake in the middle of the oven for 11-12 minutes. Bake one sheet at a time if not using a fan oven. The cookies should have expanded a bit, risen and begun to develop a firm but slightly glistening surface and should not have cracked.",
      "Remove the trays of cookies from the oven and leave to cool for 5 minutes. Transfer them to a cooling rack and leave to cool for at least another 10-15 minutes. Sprinkle a thin layer of sugar over the cookies and burn it using a kitchen blow torch. Allow to cool."
    ],
    "slug": "ube-brle",
    "servings": "12 cookies",
    "totalTime": null,
    "notes": null,
    "cookTime": "11-12 minutes",
    "source": null,
    "image": "https://ik.imagekit.io/chompchomp/recipe-ube-brle_kNYt4TQnY.jpg",
    "prepTime": null,
    "title": "Ube Brûlée",
    "ingredients": [
      "150g (5½oz/⅔ cup) butter",
      "80g (2¾oz/⅓ cup plus 1 Tbsp) light muscovado sugar",
      "120g (4¼oz/½ cup plus 1½ Tbsp) caster (granulated) sugar, plus extra for burning",
      "1 egg",
      "½-¾ tsp liquid ube extract (purple sweet potato)",
      "240g (8½oz/1¾ cups) plain (all-purpose) flour",
      "3g (1 tsp) baking powder",
      "3g (1 tsp) bicarbonate of soda (baking soda)",
      "2g (⅓ tsp) salt",
      "15g (½oz/1 Tbsp) ube powder (purple sweet potato powder)",
      "70g (2½oz) white chocolate or caramelized white chocolate, roughly chopped"
    ],
    "category": "chomp chomp",
    "description": "This is a variation on the crème brûlée, Krümel's signature cookie, which features a brûléed top and vanilla cream filling. This cookie doesn't have a filling, but if you want to add one then you can, using a piping tube filled with something tasty like vanilla cream once you have finished baking. The ube is a purple sweet potato that originally hails from the Philippines and is used in desserts and baked goods. Apart from its beautiful purple colour, it also has a nutty taste rather like vanilla. After baking, sprinkle sugar over the cookies and burn it off just like you do with a crème brûlée."
  },
  {
    "id": "unnamables",
    "ingredients": [
      "1 cup (125 g) flour",
      "1/2 cup (100 g) sugar",
      "1/2 cup (113 g) butter",
      "1 egg (50 g)"
    ],
    "slug": "unnamables",
    "cookTime": null,
    "notes": "Naming them was once considered bad luck.",
    "category": "Forgotten Cookies",
    "title": "Unnamables",
    "dishType": "Forgotten Cookies",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "image": "https://ik.imagekit.io/chompchomp/recipe-unnamables_fEgD_8LCJ.jpg",
    "totalTime": "30 minutes",
    "servings": "variable",
    "instructions": [
      "Heat oven to 350°F (175°C).",
      "Mix 1/2 cup (113 g) butter with 1/2 cup (100 g) sugar.",
      "Add 1 egg (50 g).",
      "Add 1 cup (125 g) flour; mix gently.",
      "Shape freely—uniformity discouraged.",
      "Bake 10–14 minutes depending on size."
    ],
    "description": "Unnamables are intentionally undefined. Bakers shaped them however they pleased, resisting the urge to categorize—celebrating pure, ungoverned creativity. [Historical source: \"Unnamables\" – Author: Johannes Vermeer | Work: De Pâtisserie Inconnu (Of Unknown Pastries), 1623]",
    "prepTime": null
  },
  {
    "id": "vanilla-frozen-custard-recipe",
    "title": "Vanilla Frozen Custard Recipe",
    "totalTime": "370min",
    "category": "chomp chomp",
    "instructions": [
      "### PREP MILK, CREAM, AND VANILLA BEAN:",
      "Place a medium pot over medium-high heat, and whisk together the milk, sugar, and 1 cup of the heavy cream.",
      "Use a spoon or the back of a butter knife to scrape the seeds from the vanilla bean into the pot. Add the vanilla bean to the pot, too.",
      "### HEAT MILK MIXTURE:",
      "Heat the mixture, while stirring often, until the mixture reaches 110 degrees.",
      "Cover the pot and let the mixture cool for about 25 minutes, or until it cools to 80 degrees.",
      "### MIX CUSTARD MIXTURE:",
      "Remove the vanilla bean and add the egg yolks to the pot and whisk it into the warm milk mixture until combined.",
      "### COOK CUSTARD MIXTURE:",
      "Place the pot back on the stove and heat it over medium heat. Cook, while stirring constantly (make sure you scrape all around the bottom of the pan and edges).",
      "Cook until the mixture reaches 170-175 degrees F on an instant-read thermometer. The mixture will be thickened enough to coat the back of a spoon. Remove the pot from the heat.",
      "### STRAIN:",
      "Place a fine-mesh​ strainer over a medium bowl and pour the custard mixture through the strainer.",
      "### MIX AND CHILL:",
      "Whisk in the remaining cup of heavy cream and vanilla extract. Cool the mixture for 10 minutes, and then cover it and refrigerate for at least 2 hours, or overnight.",
      "### CHURN AND FREEZE:",
      "Churn in an ice cream maker as per the manufacturer’s instructions. Churn until custard resembles soft-serve ice cream.",
      "Transfer the frozen custard to an airtight container and freeze for 3 hours.",
      "### SERVE:",
      "Scoop and serve!"
    ],
    "ingredients": [
      "1 cup whole milk",
      "¾ cup granulated sugar",
      "2 cups heavy cream (divided)",
      "Pinch of salt",
      "1 vanilla bean (cut lengthwise)",
      "6 large egg yolks",
      "1 teaspoon vanilla extract"
    ],
    "source": "[foodfolksandfun.net](https://foodfolksandfun.net/vanilla-custard-ice-cream/)",
    "cookTime": "10min",
    "image": "https://res.cloudinary.com/dlqfyv1qj/image/upload/v1/vanilla-frozen-custard-recipe.jpg",
    "description": "This Vanilla Frozen Custard Ice Cream is rich, decadent, and oh so creamy. Pair with your favorite pie, cake, or cookie or simply perfect on its own. What is Frozen Custard? Frozen custard is a frozen dessert similar to ice cream but has a richer and creamier texture. It is made from a base of cream, milk, sugar, and pasteurized egg yolks. The key difference between frozen custard and traditional ice cream is the addition of egg yolks, which gives frozen custard its smooth and velvety consistency.",
    "servings": "6 people",
    "notes": null,
    "prepTime": "30min",
    "slug": "vanilla-frozen-custard-recipe"
  },
  {
    "id": "wayfarers-puck",
    "notes": "Wayfarer’s Pucks keep well for several days when stored in an airtight container. They can be eaten as is, or paired with cheese or fruit for a more substantial meal on the go.",
    "instructions": [
      "Preheat oven to 350°F (175°C).",
      "In a large bowl, combine 2 cups (250 g) all-purpose flour, 1/2 tsp (3 g) salt, and 1 tsp (5 g) baking powder.",
      "Cut in 1/2 cup (115 g) unsalted butter using a pastry cutter or your hands, until the mixture resembles coarse crumbs.",
      "Stir in 1/3 cup (65 g) sugar.",
      "Gradually add 1/4 cup (60 ml) milk, mixing until a firm dough forms.",
      "Turn the dough out onto a lightly floured surface and roll it into a 1/2-inch (1.25 cm) thick round.",
      "Cut out 12 rounds using a biscuit cutter or a glass (roughly 3 inches / 7.5 cm in diameter).",
      "Place the rounds on a baking sheet lined with parchment paper.",
      "Bake for 25 minutes or until the edges are golden brown.",
      "Let cool on a wire rack."
    ],
    "description": "These hardy, disc-shaped pastries were designed for travelers who needed sustenance that could endure the road’s trials. With a slightly sweet, firm texture, they served both as nourishment and as a compact source of energy for weary travelers. The combination of flour and butter results in a satisfying, but not overly rich, snack that is perfect for eating on the move. [Historical source: \"Wayfarer’s Puck\" – Author: Nathaniel H. Porter | Work: Voyages et Pâtisseries de la Route (Journeys and Pastries of the Road), 1798]",
    "image": "https://ik.imagekit.io/chompchomp/recipe-wayfarers-puck_llTa7R7Hs.jpg",
    "source": "A Compendium of 35 Forgotten Cookies and Biscuits: Rediscovered Recipes from the Past",
    "title": "Wayfarer’s Puck",
    "servings": "12",
    "prepTime": null,
    "ingredients": [
      "2 cups (250 g) all-purpose flour",
      "1/2 cup (115 g) unsalted butter, softened",
      "1/3 cup (65 g) sugar",
      "1/2 tsp (3 g) salt",
      "1 tsp (5 g) baking powder",
      "1/4 cup (60 ml) milk"
    ],
    "category": "Forgotten Cookies",
    "totalTime": "1 hour 10 minutes",
    "cookTime": null,
    "dishType": "Forgotten Cookies",
    "slug": "wayfarers-puck"
  }
]