{
  "name": "Dad Jokes Ipsum",
  "subtitle": "The joke makes more sense if you don't think about it.",
  "categories": {
    "good": {
      "label": "Good",
      "jokes": [
        "I'm reading a book about anti-gravity. It's impossible to put down.",
        "I used to be a banker, but I lost interest.",
        "I don't trust stairs. They're always up to something.",
        "I got fired from the calendar factory. I took too many days off.",
        "I'm on a seafood diet. I see food and I eat it.",
        "I tried to catch fog yesterday. Mist.",
        "I used to hate facial hair, but then it grew on me.",
        "I once had a fear of hurdles, but I got over it.",
        "I'm afraid for the calendar. Its days are numbered.",
        "I don't play soccer because I enjoy the sport. I'm just doing it for kicks.",
        "I told my wife she was drawing her eyebrows too high. She looked surprised.",
        "I asked my dog what's two minus two. He said nothing.",
        "I can't believe I got fired from the keyboard factory. All I did was press the space bar.",
        "I used to play piano by ear, but now I use my hands.",
        "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day.",
        "I used to be addicted to soap, but I'm clean now.",
        "I'm reading a book about glue. I can't seem to put it down.",
        "I don't trust atoms. They make up everything.",
        "I stayed up all night wondering where the sun went. Then it dawned on me.",
        "I tried to learn origami, but I folded.",
        "I used to work in a bakery, but I couldn't make enough dough.",
        "I don't trust elevators. I take steps to avoid them.",
        "I once worked at a shoe recycling shop. It was sole destroying.",
        "I tried writing with a broken pencil. It was pointless.",
        "I used to be afraid of math, but I figured it out.",
        "I'm reading a book about teleportation. It's bound to take me places.",
        "I tried to be a watchmaker, but I couldn't find the time.",
        "I don't like jokes about construction. I'm still working on them.",
        "I used to be a gardener, but I didn't grow into it.",
        "I tried to learn sign language, but it didn't speak to me.",
        "I'm reading a book on the history of glue. It sticks with you.",
        "I used to be a photographer, but I couldn't focus.",
        "I don't trust people who do math in their head. They're too calculating.",
        "I used to work at a calendar store, but I got fired for taking days off.",
        "I tried to learn how to ice skate, but I kept falling for it.",
        "I once worked in a recycling plant. It was a lot of reprocessing.",
        "I used to be a carpenter, but I couldn't nail it down.",
        "I tried to be a musician, but I couldn't find my tempo.",
        "I don't trust clocks. They're always ticking.",
        "I tried to read a book on the history of elevators. It had its ups and downs.",
        "I once worked at a paper factory. It was tearable work.",
        "I tried to learn how to juggle, but I dropped it.",
        "I used to be a tailor, but I couldn't make the cut.",
        "I once worked at a clock store. Time flew by.",
        "I tried to learn chess, but I couldn't see the point.",
        "I don't trust scissors. They're always cutting corners.",
        "I once worked at a zoo, but I couldn't bear it.",
        "I tried to learn calligraphy, but my handwriting couldn't commit.",
        "I used to be a baker, but I couldn't rise to the occasion.",
        "I don't trust balloons. They're always full of hot air.",
        "I tried to learn pottery, but it didn't pan out.",
        "I used to be a gardener, but I didn't have the thyme.",
        "I don't trust fences. They're always on the line.",
        "I tried to learn karate, but I couldn't make a kick out of it.",
        "I used to be a librarian, but I was overdue.",
        "I don't trust bakers before noon. They're always half-baked.",
        "I once worked at a battery factory. I was charged all day.",
        "I tried to learn photography, but I couldn't develop it.",
        "I used to be a roofer, but I lost my shingles.",
        "I once worked at a carpet store. It was a lot of floor work.",
        "I tried to learn fencing, but I kept getting the point.",
        "I once worked at a map company. I lost my bearings.",
        "I tried to learn baking bread, but I couldn't knead it.",
        "I used to be a tour guide, but I lost the group."
      ]
    },
    "ionesco": {
      "label": "Ionesco",
      "jokes": [
        "I checked the clock to see if it was still time, and it was.",
        "The chair was moved slightly, and that was enough.",
        "I opened the window, and the room noticed.",
        "The calendar confirmed the day, which stayed where it was.",
        "I adjusted the light until it matched the situation.",
        "The door closed the way doors close.",
        "I checked the weather, and it continued.",
        "The table remained between us.",
        "I looked for the remote, and it was near the usual place.",
        "The room stayed the same while I was in it.",
        "I turned the knob, and the stove responded normally.",
        "The instructions were still written down.",
        "I checked the schedule, and it remained scheduled.",
        "The floor held its position.",
        "I moved the mug closer, and it stayed closer.",
        "The light switch did what it does.",
        "I checked the drawer, and it contained what it contained.",
        "The sound came from where the sound was.",
        "I straightened the paper, and it stayed straightened.",
        "The clock moved forward without comment.",
        "I opened the door to see if it would open, and it did.",
        "The room looked the same from over here as well.",
        "I lowered the volume until it was lower.",
        "The window allowed air in its usual amount.",
        "I checked the label, and it stayed attached.",
        "The chair supported its purpose.",
        "I adjusted the table, and the table adjusted accordingly.",
        "The calendar stayed on the wall.",
        "I checked the light again, and it was still light.",
        "The instructions did not change while I read them.",
        "I looked at the clock again, and it continued being a clock.",
        "The door remained closed after closing.",
        "The room was ready when we were.",
        "Everything was where it had been.",
        "That part was settled.",
        "I moved the paper slightly, and it became slightly moved.",
        "The handle stayed in place.",
        "The surface was clean enough to continue.",
        "I checked the corner, and the corner was there.",
        "The lamp stayed on.",
        "I straightened the stack, and it stayed stacked.",
        "The window stayed open until it was closed.",
        "I checked the shelf, and it held what it was holding.",
        "The room remained available.",
        "Nothing required further adjustment.",
        "I stood back, and it looked as expected.",
        "I checked the clock, and it continued as expected.",
        "The chair stayed where it was after being moved.",
        "I opened the window, and the outside stayed outside.",
        "The calendar showed the day without elaboration.",
        "I adjusted the light, and the room accepted it.",
        "The door closed without incident.",
        "I checked the weather, and it remained underway.",
        "The table stayed in place between things.",
        "I looked at the remote, and it was still a remote.",
        "The room did not change while I was looking at it.",
        "I turned the knob, and the stove stayed cooperative.",
        "The instructions remained readable.",
        "I checked the schedule, and it did not object.",
        "The floor continued supporting us.",
        "I moved the mug, and it stayed moved.",
        "The switch stayed switched.",
        "I checked the drawer, and it contained what it contained.",
        "The sound stayed where the sound was.",
        "I straightened the paper again, and it remained paper.",
        "The clock continued moving in one direction.",
        "The door stayed closed after that.",
        "The room appeared ready.",
        "Everything stayed manageable.",
        "That part required no further comment.",
        "It remained in order.",
        "I checked the clock once again, and it continued doing so.",
        "The chair remained usable after being used.",
        "I opened the window briefly, and the room stayed a room.",
        "The calendar stayed visible without further explanation.",
        "I adjusted the light slightly, and the brightness adjusted with it.",
        "The door stayed closed until it wasn't.",
        "I checked the weather once more, and it persisted.",
        "The table continued serving its purpose.",
        "I moved the mug a little, and it stayed there.",
        "The instructions remained legible throughout.",
        "I checked the schedule again, and it was still scheduled.",
        "The floor stayed firm underfoot.",
        "I turned the switch, and the switch complied.",
        "The room remained arranged.",
        "Everything stayed as expected.",
        "That was sufficient."
      ]
    }
  }
}
